{"shop": "castlery", "url": "https://www.castlery.com/us/our-story", "title": "Our Story | Castlery US", "content": "Since launching in 2013, we’ve always believed that furniture gets better with living. Our design process begins with a simple truth: furniture should be built for how people actually live. We craft our pieces with inventive details that will make you wonder how you ever lived without them. There's something about us that's different from everyone else. And that's our Obsessions. These are the signature details we keep coming back to, designed to solve those pesky everyday problems. A better home, without costing the planet. Sustainability Find your forever piece. All products​ Furniture tips, design ideas, trends, and more. Blog​ Obsessed with the details? You'll fit right in. Careers"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "Delivery | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Delivery Delivery Last updated: Feb 25, 2025 ECO delivery — Partnership with Maersk ​ We are committed to adopting low-GHG fuel options. To date, we have successfully reduced ocean freight emissions by 5,000 metric tons. Over the next decade, we aim to further reduce carbon emissions by at least 1,000 metric tons per year, in collaboration with Maersk. ​ What this means for you ​ Your Castlery order will support the transition to green fuels and reduce GHG emissions at no extra cost to you. ​​ How it works ​ For our shipments, Maersk replaces fossil fuels on its ships with green fuels* like green methanol or second-generation biodiesel based on waste feedstocks. The amount of carbon savings is calculated based on the energy used to move the containers, as reported by Maersk and verified by 3rd parties from Smart Freight Centre. ​​ Maersk defines ’green fuels’ as fuels with low (65-80%) to very low (80-95%) GHG emissions over their life cycle compared to fossil fuels ​ Read more about Maersk ECO Delivery here. Delivery information At Castlery, we take pride in the manufacturing of our furniture. It is our goal to deliver your purchase to you in the quickest and most efficient way possible. All our products are fully packaged for safe transit and will be handled by professional third-party delivery carriers. We work with multiple specialist delivery partners to ensure your order reaches you safely and on time. This may result in your order having multiple shipments from separate delivery partners. Kindly note that shipping cost is calculated per shipment (not per total order), based on the warehouse location that your product(s) is shipped from.​ Speed of delivery depends on the type of product, product availability, and proximity to metropolitan areas. To help you with your purchasing decision, you may find"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "in your order having multiple shipments from separate delivery partners. Kindly note that shipping cost is calculated per shipment (not per total order), based on the warehouse location that your product(s) is shipped from.​ Speed of delivery depends on the type of product, product availability, and proximity to metropolitan areas. To help you with your purchasing decision, you may find out more about delivery lead times on each individual product page.​ You may enter your zip code on any product page to check if we deliver to your area. If your area is currently unavailable, we recommend subscribing to our newsletter or following us on social media to stay informed about our latest updates. All shipments are delivered Monday to Friday between 9:00 am and 7:00 pm, with specified hours on Saturdays in selected cities. If you wish to request to see if a Saturday delivery is possible for your area, please reach out to us before your order has been processed. Kindly note, not all requests can be fulfilled. Please note that it is your responsibility to check that your items will fit through doors, staircases and elevators in their packaging before you place your order. Product and package dimensions are included in the product description on our website. Failed delivery due to inability to access your home will result in additional delivery charges. Please note that while we may be able to have your order shipped to a freight forwarder, once the shipment is in their hands, Castlery is released of all responsibility for issues that may arise during and as a result of the freight forwarding process. Shipping fees and locations Flat Rate Shipping Per Shipment We make shipping simple! Shipping fees are charged per shipment, not per order. If your order includes multiple items with different delivery times, we may split it into multiple shipments. Each shipment fee is calculated based on your location and the order subtotal. You will see the total shipping fees in the checkout page. Want to Know If We Deliver to Your Area? To find out if we deliver to your"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "per order. If your order includes multiple items with different delivery times, we may split it into multiple shipments. Each shipment fee is calculated based on your location and the order subtotal. You will see the total shipping fees in the checkout page. Want to Know If We Deliver to Your Area? To find out if we deliver to your city, enter your zip code on any product page. Plus, we offer free shipping on orders with a subtotal of $1,199 or more (excluding add-on services) to selected cities! Types of delivery We offer 3 types of delivery service options: Standard, Room of Choice or White Glove. We provide a Standard service by default, but you may opt for Room of Choice or White Glove service for an additional service fee. Each service fee is per shipment, not per order. If the order contains multiple shipments, you will be able to select which shipment(s) you would like to apply the delivery service to during the checkout process. Standard service We will deliver your item(s) to either the ground floor, lobby or first dry area of your home (such as garage, front porch, lobby, etc) or apartment building. Deliveries to any address that require using a lift or staircase will be left at the entrance of the lift or foot of the stairs. This service does not include unpacking, assembly or garbage removal. To initiate delivery, we will send an email notifying that your order is ready to ship. You will then either receive a fixed delivery date with tracking information or be contacted by our delivery partner to arrange a delivery day and time window. Room of choice We will deliver your item(s) to the room of your choice within your home, inclusive of up to two flights of stairs. An extra flat rate of $50 or $70 apply, depending on your zip code (plus applicable taxes). Kindly note, additional stairs beyond two flights are subject to add-on fees. This service does not include assembly, garbage removal or moving of your old or existing furniture. To initiate delivery, we will"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "your home, inclusive of up to two flights of stairs. An extra flat rate of $50 or $70 apply, depending on your zip code (plus applicable taxes). Kindly note, additional stairs beyond two flights are subject to add-on fees. This service does not include assembly, garbage removal or moving of your old or existing furniture. To initiate delivery, we will send an email notifying that your order is ready to ship. You will then be contacted by our delivery partner to arrange a delivery day and time window. White glove We will deliver your item(s) to your room of choice, inclusive of up to two flights of stairs, unpacking and full assembly of item(s), as well as garbage removal. This service is an extra flat rate fee of $100 or $150 (plus applicable taxes), depending on your zip code. Kindly note, additional stairs beyond two flights are subject to additional fees. This service does not include removal or moving of your old or existing furniture. To initiate delivery, we will send an email notifying that your order is ready to ship. You will then be contacted by our delivery partner to arrange a delivery day and time window. Note: Please measure and ensure that your items will fit through doors, staircases and elevators in their packaging before you place your order. If we are unable to get your furniture into your home, you will be responsible for redelivery fees if you choose to have the products redelivered at a later date, or the return shipping and warehouse restocking fees if the order is cancelled. Upon arrival, our delivery partners will deliver your products based on the selected service options. In addition, please protect your flooring and surroundings from potential damages prior to the delivery. Our delivery partners will not be responsible for any flooring or surrounding damages. Delivery personnel are not permitted to move existing furniture present in your home. To get a better understanding of the service in your area based on the items you have purchased, feel free to contact us . Add-on services & charges We provide"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "prior to the delivery. Our delivery partners will not be responsible for any flooring or surrounding damages. Delivery personnel are not permitted to move existing furniture present in your home. To get a better understanding of the service in your area based on the items you have purchased, feel free to contact us . Add-on services & charges We provide disposal service for the old furniture item that your new Castlery item will replace. This service only applies to like-for-like items in the same product category (i.e. the delivery of your new Castlery sofa and the disposal of your old sofa). Please note that this disposal service is currently available in selected regions only. You may check if the service is available for you by entering your zip code during checkout. A disposal service fee of $50 per item applies. You may arrange for disposal service at any of the following points: During checkout: An option to add on disposal service will be available. At least 3 business days before scheduled delivery date: If you require disposal service but have not arranged for it during checkout, you may request for the service by contacting us at least 3 business days before your scheduled delivery date (i.e., if your delivery is scheduled on Friday this week, please request for the service on Monday or earlier, assuming there is no public holiday in between). Castlery reserves the right to reject disposal items in any of the following situations: Item cannot fit through doors and/or into the elevator. (Note: If required, please disassemble the disposal item prior to delivery. This disposal service does not include dismantling the disposal item) Item is infested with termites, bed bugs or any other living organisms. Item exceeds 175 pounds. It is a last-minute disposal request made during the delivery of your Castlery item. In such cases, we will refund the full disposal fee within 14 business days. Receiving items For security purposes, our delivery partners may verify your photo ID prior to the unloading of the products. Failure to comply with verification requests will be considered as"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "175 pounds. It is a last-minute disposal request made during the delivery of your Castlery item. In such cases, we will refund the full disposal fee within 14 business days. Receiving items For security purposes, our delivery partners may verify your photo ID prior to the unloading of the products. Failure to comply with verification requests will be considered as refusing delivery, the item(s) will be returned to the warehouse, and a service fee will be charged. If you choose to reschedule, a secondary delivery fee will be applied. Upon delivery, you or a third party appointed by you shall inspect the item(s) carefully before our delivery partner leaves the premises. Any damaged or defective items must be reported to Castlery within 14 days of delivery and noted on the proof of delivery document. Please contact us and provide photos showing the damage or fault. We will reply within 2 business days. Castlery reserves the right in its absolute discretion to determine whether a product or a component of a product has failed due to a defect or wear and tear. Such replacement or repair is offered by Castlery at its sole discretion. In the event that an exchange for the defective piece cannot be arranged, Castlery reserves the right to offer a substitute or full refund. All repair or replacement of item(s) will depend on inventory availability. Castlery shall not be liable for any consequences (whether direct or indirect) of the delay in the delivery of the goods and no such delay shall entitle the customer to treat this agreement as being repudiated by Castlery or to any comparison. Signing of Proof of Delivery receipt (POD) A POD is not simply a receipt of delivery, but an acknowledgment that the goods arrived intact. All too often, PODs are signed without inspecting your delivery. We advise confirming that the shipment was intended for you, that the entire order has been delivered, and that it was delivered undamaged. Anything not indicated on this form before signature will result in Castlery being unable to authorize any damage claims after your driver has"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "the goods arrived intact. All too often, PODs are signed without inspecting your delivery. We advise confirming that the shipment was intended for you, that the entire order has been delivered, and that it was delivered undamaged. Anything not indicated on this form before signature will result in Castlery being unable to authorize any damage claims after your driver has left. Please follow this checklist we have created for you to follow before the Proof of Delivery (POD) is signed: Checklist: 1. Please check all cartons for visible damage. 2. Please confirm you have received the correct items as per the POD and the delivery order. 3. If you have White Glove delivery: Please wait until all items have been assembled and there is no visible damage to the items. Then sign off on POD. 4. If there is serious damage to a carton point it out to the delivery driver. 5. If there is damage: Please take photos of the damage and cartons. 6. Please indicate any property damage caused by delivery on the POD. We will need to photographs and video footage of the damage occurring to document the damage. After you’ve gone through your entire shipment and documented any issues, you may obtain the driver’s signature or initials next to your notes about the damaged items on the POD. *Please do not dispose cartons until the issue is resolved. Estimated delivery date ‘Estimated Delivery’ lead-times shown on each product page indicate the estimated date range you can expect the item to arrive at your delivery location. This lead time includes time taken for stock movement from manufacturing locations to our warehouse (this includes factors such as whether an item is made-to-order), and last mile delivery to your door. Simply enter your zip code on any product page to see an estimate of when you can expect to receive the item. Please note that these dates are an estimate and may be subject to potential unforeseen delays. Want us to hold off your delivery date because your home is not ready? Simply place your order, then reply to"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "door. Simply enter your zip code on any product page to see an estimate of when you can expect to receive the item. Please note that these dates are an estimate and may be subject to potential unforeseen delays. Want us to hold off your delivery date because your home is not ready? Simply place your order, then reply to your order confirmation email with any special requests. We strive to respond to your request within one business day, but please note that not all requests can be accommodated. Scheduling and tracking of shipments You will receive an email notification when your order has left our local warehouse. For delivery by FedEx/UPS, you will be provided with the tracking information in the email. For delivery by our specialized carriers, you will be contacted directly by the carrier to confirm a delivery date and timeframe. Delaying/ Hold shipments Once your order is ready to be shipped, you will receive a “An Update for You!” e-mail. Castlery will provide up to 2 months free storage from when the e-mail was sent. To hold your order, requests must be made within 24 hours of receiving that email. If we do not receive the request within that 24-hour time frame, the order will be processed. After the 2 months' free storage period, storage charges will be at 5% of the item value per month. Additionally, we are able to provide 14 days of free storage for all processed shipments. The 14 days of free storage begins from when you receive the “It's on its way!” e-mail and/or when attempt of delivery scheduling begins. Should you require a hold of your shipment beyond the 14 days of free storage offered, we are able to hold for an additional 14 days max for a fee. Storage charges for the additional 14 days will be at 10% of the order/product shipment value that is on hold. All charges incurred will be subject to taxes. Delayed Shipments / Delivery due to unforeseen situations In the event of delay in shipment due to unforeseen situations, Castlery reserves the right"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "for an additional 14 days max for a fee. Storage charges for the additional 14 days will be at 10% of the order/product shipment value that is on hold. All charges incurred will be subject to taxes. Delayed Shipments / Delivery due to unforeseen situations In the event of delay in shipment due to unforeseen situations, Castlery reserves the right to reschedule the delivery, subject to the availability of the next open delivery date. No specific time of delivery can be provided. A time frame will be advised but cannot be guaranteed. Castlery shall not be liable for any consequences or any loss suffered or expenses incurred (whether direct or indirect) due to the delay in the shipment / delivery of the goods and no such delay shall entitle the customer to treat this agreement as being repudiated by Castlery or to any comparison. Redelivery fee Any last-minute changes for scheduled delivery dates must be requested 3 business days prior to your confirmed delivery. Any last-minute requests after said timeframe will be subject to a re-delivery fee of $100 as well as any applicable taxes. Missed deliveries Our delivery partners will contact you to schedule your delivery slot. Please note that orders will be cancelled and subject to a 20% restocking fee if you cannot be reached to schedule your delivery date with the carrier. During the day of delivery, you will need to be available to be contacted either by call or text message. If you are not present and/or available at the delivery address within your allocated delivery slot, our delivery partners will wait for approximately 15 minutes before they leave. All undeliverable orders will be returned to our distribution center and restocked. To reschedule for a delivery to the correct delivery address, we will contact you to arrange for the next available delivery with a re-delivery fee of $100 charged. We do ask that you let our delivery partners know of any necessary changes to your delivery slot at least three business days in advance. Incorrect delivery address All undeliverable orders will be returned to our distribution"}
{"shop": "castlery", "url": "https://www.castlery.com/us/delivery", "title": "Delivery | Castlery US", "content": "to the correct delivery address, we will contact you to arrange for the next available delivery with a re-delivery fee of $100 charged. We do ask that you let our delivery partners know of any necessary changes to your delivery slot at least three business days in advance. Incorrect delivery address All undeliverable orders will be returned to our distribution center and restocked. To reschedule for a delivery to the correct delivery address, we will contact you to arrange for the next available delivery with a re-delivery fee of $100. Delivery restrictions We reserve the right to refuse delivery to specific locations for items we deem at high risk of loss or damage, and also areas that are inaccessible for our home delivery services. We cannot deliver to PO boxes or Parcel Lockers because they're usually too small to accept most of the items we sell. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/warranty", "title": "Product Warranty | Castlery US", "content": "Product Warranty | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Warranty Warranty Last updated on May 28, 2025 Castlery warrants that all our furniture is free from defective materials and workmanship. Warranty periods vary by product, commencing from the date of delivery and are defined in the table below. If, during the warranty period, a product is deemed defective due to a manufacturing defect, Castlery will repair or replace part(s), at Castlery’s sole discretion. This Warranty covers the replacement or repair of any product or part of any product that has a manufacturing or material defect that is not the result of normal wear and tear, customer misuse, alternative handling, or a natural characteristic of the material used. 1. Claim procedure Any claims will have to be emailed to help.us@castlery.com attached with photos of defects, and order number. 2. Limitations and exceptions Proper care and usage are essential to preserving your rights under this warranty. This warranty does not apply if your Castlery furniture is damaged by using detergents, abrasives or other harsh cleaning agents. This warranty does not cover damage resulting from negligence, abuse, normal wear and tear, or accidents: including (but not limited to) burns, cuts, scratches, tears, scuffs, watermarks, indentations or damage from pets. This warranty does not apply if product is used outdoors, unless specifically stated otherwise. Any product modification by consumer or other parties not authorized by Castlery will void this Warranty. This Warranty does not cover items marked as ‘AS-IS’ or any form of Display items at the time of purchase. This Warranty does not cover items not purchased directly from Castlery. Castlery’s decision on all issues relating to complaints regarding defects, either of workmanship or materials, shall be final and conclusive. Any decision to repair or have part(s) replaced shall be at Castlery’s sole discretion. Any item repaired or replaced under this limited Warranty will"}
{"shop": "castlery", "url": "https://www.castlery.com/us/warranty", "title": "Product Warranty | Castlery US", "content": "at the time of purchase. This Warranty does not cover items not purchased directly from Castlery. Castlery’s decision on all issues relating to complaints regarding defects, either of workmanship or materials, shall be final and conclusive. Any decision to repair or have part(s) replaced shall be at Castlery’s sole discretion. Any item repaired or replaced under this limited Warranty will be covered by the limited Warranty for the remainder of the original warranty period only. This Warranty covers in respect of manufacturing defects detected within the warranty period, the cost of material components, replacement parts, labor and transportation charges. Comfort is subjective to the individual and is not considered a manufacturing fault. In respect of manufacturing defects detected after the warranty period, the cost of material components and replacement parts, with all labor charges and transportation costs (if any) are to be covered by the Purchaser. 3. Warranty period The quality of our furniture is of utmost importance to us at Castlery. We conduct stringent in-house quality inspections of our products to ensure that your beloved furniture pieces last a long time. You may refer to the table below for the warranty coverage we provide for your items. Type Warranty Coverage Sofas, Sofas with Moveable Headrest, Armchairs, Ottomans, Beds, Storage Beds, Sofa Beds, Daybeds Frame structure: 10-Year Limited Warranty Covers: 1-Year Limited Warranty Other components (such as foam, fibre fillings, feathers, stitching, zips, fasteners, springs, suspensions, legs, sliders and drawers, and movable mechanisms - swivel bases and reclining mechanism): 2-Year Limited Warranty Dining Chairs Frame structure: 10-Year Limited Warranty Covers: 1-Year Limited Warranty Other components (such as foam, fibre fillings, stitching, zips, fasteners, suspensions, legs, metal parts): 2-Year Limited Warranty Office Chairs Frame structure: 10-Year Limited Warranty Covers: 1-Year Limited Warranty Other components (such as foam, fibre fillings, stitching, zips, fasteners, suspensions, legs, locks, cranks, wheels and castors, movable mechanisms - swivel bases): 2-Year Limited Warranty TV Stands, Sideboards, Dining Tables, Coffee Tables, Side Tables, Bookcases, Free Standing Shelves Frame structure: 5-Year Limited Warranty Other components (such as drawers, door glides, handles, table extensions, hinges, locks, metal parts): 2-Year Limited"}
{"shop": "castlery", "url": "https://www.castlery.com/us/warranty", "title": "Product Warranty | Castlery US", "content": "Warranty Other components (such as foam, fibre fillings, stitching, zips, fasteners, suspensions, legs, locks, cranks, wheels and castors, movable mechanisms - swivel bases): 2-Year Limited Warranty TV Stands, Sideboards, Dining Tables, Coffee Tables, Side Tables, Bookcases, Free Standing Shelves Frame structure: 5-Year Limited Warranty Other components (such as drawers, door glides, handles, table extensions, hinges, locks, metal parts): 2-Year Limited Warranty Outdoor Products (excludes umbrellas) Frame structure: 5-Year Limited Warranty Covers: 1-Year Limited Warranty Other components (such as foam, stitching, zips, fasteners, suspension, legs, wheels and castors, wicker): 2-Year Limited Warranty Bedding Products 1-Year Limited Warranty Lighting and other Electrical Accessories 2-Year Limited Warranty Rugs 1-Year Limited Warranty Poufs, Cushions & Throws 1-Year Limited Warranty Dinnerware & Glassware 1-Year Limited Warranty Mirrors 2-Year Limited Warranty Organisation Products 1-Year Limited Warranty Mulberry Extended Protection All Castlery products are equipped with warranty coverage. Seeking additional peace of mind? You may wish to purchase a Mulberry Extended Protection Plan . When placing an order for furniture on our website, simply select a plan with options ranging from 1-5 years’ warranty. Castlery began offering Mulberry Extended Protection Plans on April 11th, 2022. These extended warranty plans protect your furniture against drops, spills, scratches, and more. Energetic toddler running around the house or a furry companion that loves snoozing on your rugs? No issue. If you’ve purchased a plan and had a change of mind, find out more about our refunds process here . What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/warranty", "title": "Product Warranty | Castlery US", "content": "and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "Sales and Refunds | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Sales And Refunds Sales & Refunds Terms and Conditions Last updated: May 22, 2025 Thank you for shopping at Castlery! We appreciate that you're looking to buy the cool stuff we love to build. We also want to make sure you have a rewarding experience while exploring, evaluating, and purchasing our products. As with any shopping experience, there are terms and conditions that apply to transactions at Castlery. By placing an order or making a purchase at Castlery, you agree to the terms set forth below along with Castlery’s Privacy Policy and Terms of Use . Please note that Castlery has a zero tolerance policy for inappropriate behavior. Abusive, inappropriate, or harassing behavior toward Castlery associates will not be tolerated in any form. Any behavior deemed inappropriate toward any Castlery associates may result in order cancellations, blocked communications, refusal of service, or other actions necessary to ensure the safety, comfort, and respect of all Castlery associates. I. 30-day return policy We fundamentally believe you will be thrilled with the products you purchase from Castlery. That’s because we go out of our way to ensure that they’re designed and built to be just what you need. We understand, however, that sometimes a product may not be what you expected it to be. In that event, we invite you to review the following terms related to returning a product. The return Return requests can only be made within 30 days of the date you've received the item. To initiate this request, please contact us so that we can facilitate the return. Please note that the policy is subject to the conditions below: There is a 20% restocking fee charged per returned item; this fee is deducted from your refund. Only items in as-new condition can be returned. Products with scratches, stains, damages, drilling,"}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "you've received the item. To initiate this request, please contact us so that we can facilitate the return. Please note that the policy is subject to the conditions below: There is a 20% restocking fee charged per returned item; this fee is deducted from your refund. Only items in as-new condition can be returned. Products with scratches, stains, damages, drilling, or any other modification will not be accepted. We reserve the right not to refund a product that, in our reasonable opinion, has become of unacceptable quality due to fair wear and tear, misuse; or as a result of failure to take reasonable care of the product. Please return the items in the original packaging, which is designed carefully to avoid shipping damages. If you have already discarded the original packaging, you can use the best packaging material that you can find to package the item sufficiently to avoid damage in transit back to us. An additional $50 repackaging fee per item will be charged for returned items without its original packaging. We encourage customers to photograph the items scheduled for return and the condition of the packaging before handing them over to our delivery partners. We are unable to accommodate returns / exchanges / refunds for the following items: Any item marked as 'Clearance' or specified as on 'Final Sale' Any form of Display items Any item described as \"Customized\" or \"Customizable\" Upon receiving your order, kindly inspect your products carefully for any damages. All quality-related issues must be reported within 30 days of receiving your items. Cases submitted after this timeframe may not be accepted and will be subjected to shipping fees and tech fees in the event that your item needs to be replaced. Additionally, rather than offering exchanges should you decide you would like to return a product, Castlery shall process all exchanges as normal returns per the guidelines outlined in the Return Policy. You may then choose to purchase a new item at your convenience. The refund Please note that there is a 20% restocking fee for all returned items; this fee is deducted from"}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "offering exchanges should you decide you would like to return a product, Castlery shall process all exchanges as normal returns per the guidelines outlined in the Return Policy. You may then choose to purchase a new item at your convenience. The refund Please note that there is a 20% restocking fee for all returned items; this fee is deducted from your refund. Shipping fees as well as additional service fees paid for Room of Choice or White Glove service will not be refunded. You may also be charged a $50 repackaging fee per item if item is not returned in its original packaging. Refund will commence within 7 business days after all returned items have been sent back to our warehouse. Where possible, funds will be processed back in the same way they were paid to Castlery, i.e. back to your Credit Card, PayPal or Bank Account. For credit cards, depending on your card issuer’s policy, it may take up to 3 to 5 business days for the refund to appear on your account. However, refunds for some banks may only be reflected in your next monthly statement. II. Order change or cancellation If you decide to change or cancel your order, please contact us any time before your shipment is processed to avoid incurring additional charges. You will receive a reminder in advance that your shipment is ready to be processed, and you will have 24 hours to request changes or cancellation without incurring charges. After that, your shipment will be processed and any changes or cancellation from thereon will incur a 20% restocking fee . We are unable to accommodate order changes / cancellations / refunds for the following items: Any item marked as 'Clearance' or specified as on 'Final Sale' Any form of Display / As-Is items Any item described as \"Customized\" or \"Customizable\" In the event you wish to cancel your existing order and place a new order, kindly note that a new 'Estimated Delivery’ date will be given at the time of new purchase. Cancellation of orders with discount voucher If you cancel any item(s)"}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "on 'Final Sale' Any form of Display / As-Is items Any item described as \"Customized\" or \"Customizable\" In the event you wish to cancel your existing order and place a new order, kindly note that a new 'Estimated Delivery’ date will be given at the time of new purchase. Cancellation of orders with discount voucher If you cancel any item(s) in your order with a discount voucher/coupon applied, you will be refunded only the final paid price after the applied discount – which is apportioned among the items in your order according to their respective value. The value discount will be apportioned in this manner: (Each line item’s purchase price / total order value) x discount voucher value. Upon cancellation of item(s) in your order, the whole absolute-value of the discount voucher which was initially applied will not be re-issued or re-apportioned to the remaining item(s) in the revised order. Your remaining item(s) are still entitled to the discount value that was initially apportioned per line item before the cancellation of item(s) in your order. Discount codes and vouchers are single-use only. They cannot be transferred or reused in any manner. The above Order Change and Cancellation Policy may not necessarily be applicable to all products. For cancellation details pertaining to a specific product, please refer to the Product Info section in its product page. “Display”, \"Customized\" or \"Customizable\" items are not eligible for cancellation. Please contact us to process this request. Restocking fees Please note that a restocking fee of 20% will be applied to cover the costs of processing and handling the returned item(s). This includes shipping the item back to our warehouse and/or one of our partners. We take pride in finding new homes for returned items whenever possible, and after a thorough review, we may decide to donate or resell the item to a trusted third-party partner. This helps reduce waste and ensures that the item finds a new home. Mulberry warranty We understand that “oops” situations are part and parcel of everyday life, and that’s why we’ve partnered with Mulberry to provide you with Mulberry’s"}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "whenever possible, and after a thorough review, we may decide to donate or resell the item to a trusted third-party partner. This helps reduce waste and ensures that the item finds a new home. Mulberry warranty We understand that “oops” situations are part and parcel of everyday life, and that’s why we’ve partnered with Mulberry to provide you with Mulberry’s Extended Protection Plans. Purchased a plan and had a change of mind? No worries. You will receive a 100% refund if you let us know within 30 days upon receiving your Castlery product(s). Kindly note that beyond the 30th day, all refunds will be prorated on a yearly basis. The below table is an example based on a $125 five-year plan: Duration of use* Amount refunded Within the 1st year $100 Within the 2nd year $75 Within the 3rd year $50 Within the 4th year $25 Within the 5th year $0 In the event a claim has been successfully filed over the duration of your warranty plan, please be informed that we will not be able to process any refunds or cancellations. For assistance, please reach out to us at help.us@castlery.com III. Prices, payment and tax All prices listed on product webpages are in US dollars before sales tax. We accept payment by Visa, MasterCard, Amex and PayPal. For orders made on Massachusetts Tax-Free Weekend (14 - 15 August 2021), please email help.us@castlery.com with your order number for tax refunds. Please take note that orders must fulfil either of the following to be eligible for tax refunds:​ • Order with a final payable amount of less than $2,500​ • Order comprised of all products below $2,500​ Our team will respond to the request within 3-5 working days and manually process the refund for eligible orders. IV. Pricing and price reductions/corrections Castlery reserves the right to change prices for products displayed at any time, and to correct pricing errors that may inadvertently occur. V. Order acceptance/confirmation When making an order, you must possess a valid credit or debit card and have registered an account on our website. To place an order,"}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "the refund for eligible orders. IV. Pricing and price reductions/corrections Castlery reserves the right to change prices for products displayed at any time, and to correct pricing errors that may inadvertently occur. V. Order acceptance/confirmation When making an order, you must possess a valid credit or debit card and have registered an account on our website. To place an order, you should follow the given instructions. Castlery may, in its sole discretion, refuse or cancel any order and limit order quantity. Castlery may also require additional qualifying information prior to accepting or processing any order. Once we receive your order, we’ll provide you with an email order confirmation sent to the email address on file. Your receipt of an order confirmation, however, does not signify Castlery’s acceptance of your order, nor does it constitute confirmation of our offer to sell; we are simply confirming that we have received your order. Castlery reserves the right at any time after receiving your order to accept or decline your order for any reason. If Castlery cancels an order after you have already been billed, Castlery will refund the billed amount. Irrespective of any previous price you have seen or heard, once you select a product that you wish to order, you will then be shown the charges you must pay, if applicable, and any applicable delivery charges. You must pay for the product in full when placing an order by one of the payment methods we provide on the website. In any event, we shall not be bound to accept the order before we have received the funds in full. You undertake that all details you provide to us for the purpose of purchasing the product from us will be correct, that the credit or debit card, or account or other payment methods which you use is your own and that there are sufficient funds or credit facilities to cover the cost of the product. We reserve the right to obtain validation of your payment details before providing you with the product. When you submit an order to the website, you agree that"}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "credit or debit card, or account or other payment methods which you use is your own and that there are sufficient funds or credit facilities to cover the cost of the product. We reserve the right to obtain validation of your payment details before providing you with the product. When you submit an order to the website, you agree that you do so subject to these terms and conditions current at the date you submit your order. You are responsible for reviewing the latest terms and conditions each time you submit your order. VI. Delivery Please view the Delivery page to learn about how and when you will receive the products you purchased from Castlery. Since the actual delivery of your order can be impacted by many events beyond Castlery’s control once it leaves our facilities, Castlery cannot be held liable for late deliveries. We will, however, work with you to ensure a smooth delivery. Once your order has been handed over to the carrier for delivery, you will receive a shipment notification with a delivery date. You can track your order status on our website. VII. Our product information We endeavor to ensure that all the products on our website are accurately described, and we rely on information provided to us by our suppliers. Unfortunately, on some occasions, it is possible that our website will contain errors and we reserve the right to correct any errors or inaccuracies at any time, including after you have placed an order. In some cases, the products we offer for sale are hand-made or made from natural or organic materials, and there may be small variations between the product image(s) and the product you receive. This will always be stated on the individual product listing. We endeavor to ensure that all colors are displayed accurately, but you should be aware that colors may appear slightly differently on different displays and screens. The shade of color from screen to screen is not a fault or error. We aim to update our website regularly and may change the content at any time. If the need"}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "product listing. We endeavor to ensure that all colors are displayed accurately, but you should be aware that colors may appear slightly differently on different displays and screens. The shade of color from screen to screen is not a fault or error. We aim to update our website regularly and may change the content at any time. If the need arises, we may suspend access to our website, or close it indefinitely. We will use reasonable endeavors to ensure our website contains accurate information and content, however, we reserve the right to update our website as soon as an inaccuracy or error is brought to our attention. VIII. Conditions for the redemption of promotional vouchers From time to time we may release promotional vouchers that may be used on the website. Promotional vouchers can only be redeemed on the website in accordance with the special terms and conditions stated on them. Promotional vouchers are valid for the specified period stated on them only, can only be redeemed once and cannot be used in conjunction with other offers (including, for the avoidance of doubt, sales, promotions and other vouchers). Individual brands may be excluded from voucher promotions. The credit of a promotional voucher cannot be used to pay for products from third parties. If you place an order for a product less than the value of the promotional voucher, no refund or residual credit will be returned to you. The credit of a promotional voucher does not accrue interest nor does it have a cash value. If the credit of a promotional voucher is insufficient for the order you wish to make, you may make up the difference through payment by other means (but not by using another promotional voucher or attempting to rely on any other offer). Please note that only one promotional voucher can be used per order. Promotional vouchers are applied to the invoice as a whole. Accordingly, in circumstances where multiple products are purchased using a voucher, and one or more items are returned, the discount is applied on a pro rata basis to each item for"}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "attempting to rely on any other offer). Please note that only one promotional voucher can be used per order. Promotional vouchers are applied to the invoice as a whole. Accordingly, in circumstances where multiple products are purchased using a voucher, and one or more items are returned, the discount is applied on a pro rata basis to each item for the purpose of establishing refund values. IX. 14-day price protection policy A 14-day price protection policy is offered from the date of purchase, and is only applicable if an item from your order goes on clearance within that period. This policy excludes limited-time price reductions (e.g., special sales events), bundle deals, or ongoing promotional offers (refer to Promo T&C Page ). To request a price adjustment, please email help.us@castlery.com with your sales order number within 14 days of the purchase date. Once verified, store credits* will be issued for the price difference between the original purchase price and the current clearance price (*refer to Store Credits T&C ). These credits can be redeemed for a discount code towards a future purchase. Cash refunds are not available under this policy. If you choose to cancel your order to re-order under a new promotion, the new order will be subject to fresh stock allocation, which may result in a later delivery date. The 14-day Price Protection Policy is done at Castlery's sole discretion and is not guaranteed. Have more questions? Visit our Contact us page. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/sales-and-refunds", "title": "Sales and Refunds | Castlery US", "content": "Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/help-center", "title": "Help Center | Castlery US", "content": "Help Center | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Help Center Help Center What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/seb-extendable-dining-table-74-8-94-5", "title": "Seb Extendable Dining Table, 74.8\"-94.5\" | Castlery US", "content": "Seb Extendable Dining Table, 74.8\"-94.5\" | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Tables Dining Tables Seb Extendable Dining Table, 74.8\"-94.5\" Home Tables Dining Tables Seb Extendable Dining Table, 74.8\"-94.5\" Bestseller Seb Extendable Dining Table, 74.8\"-94.5\" 139 reviews $1,199 Model: 4-6 Seater Table 6-8 Seater Table 4-6 Seater Set 6-8 Seater Set Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Rustic, homey and thoughtfully crafted, Seb is a mid-century collection made to create warm, cozy spaces. View the Seb Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Solid acacia wood Finish : Muted honey tone and wire brush distressed finish Hardware feature : Split table top with butterfly leaf mechanism Care : Extendable table Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Click to expand Dimension : W74.8\"/94.5\" x D39.4\" x H29.5\" Table top thickness : 1.6\" Product weight : 152.1 lbs Capacity : Sits 8 people comfortably Packaging dimensions : 1 box Leg height : 28\" Leg to leg distance (at height 17.7'') : 61.4\" Leg room - height clearance : 22.4\" Max bearing support : 330.7 lbs Levellers : Included (max 0.4\") Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/seb-extendable-dining-table-74-8-94-5", "title": "Seb Extendable Dining Table, 74.8\"-94.5\" | Castlery US", "content": "Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/casa-dining-table?length=1_54m", "title": "Casa Dining Table | Castlery US", "content": "Casa Dining Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Tables Dining Tables Casa Dining Table Home Tables Dining Tables Casa Dining Table New Casa Dining Table 61 reviews $799 Model: Bench Dining Table Dining Set Length : 60.6\" 60.6\" 71\" 86.6\" Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply With a clean, minimalist build and angled blade legs, Casa sets the scene for meals and conversations that stretch long past the last bite. View the Casa Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Body: engineered wood with acacia veneer; Leg: solid acacia wood Finish : NC coating in white wash, solid white wash and light wire brush Care : Wooden table Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Click to expand Dimension : W60.6\" x D31.5\" x H29.9\" Table top thickness : 2.4\" Product weight : 102.5 lbs Capacity : Sits 6 people comfortably Packaging dimensions : 2 boxes Leg height : 27.6\" Leg to leg distance (at height 17.7'') : 49.6\" Leg room - height clearance : 27.6\" Max bearing support : 299.8 lbs Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : Lived-in finish Wire-brushed white-washed acacia wood shows off natural grain while handling spaghetti night, art projects, and \"oops, forgot the coaster\" moments with grace. More room to stretch out​ Our angled blade legs stand independently, creating open space beneath the table. More room for taller friends and unexpected plus-ones. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/casa-dining-table?length=1_54m", "title": "Casa Dining Table | Castlery US", "content": "handling spaghetti night, art projects, and \"oops, forgot the coaster\" moments with grace. More room to stretch out​ Our angled blade legs stand independently, creating open space beneath the table. More room for taller friends and unexpected plus-ones. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/vincent-dining-table-oak?length=1_5m", "title": "Vincent Dining Table, Oak | Castlery US", "content": "Built to last The rich grain of solid American white oak wood is a natural conversation starter in your dining room. Its unique character—knots, nicks, and all—will only look better through years of morning coffee and in-law visits. Family-friendly design No sharp edges here. Precision-crafted, softly curved corners give kids a worry-free place to eat and play (with their food, that is). Reinforced support Strength you can count on—thanks to a hidden brace that keeps the tabletop sturdy and the wood’s natural beauty center-stage."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/emmerson-adjustable-standing-desk?length=1_2m&wood=chinese_walnut", "title": "Emmerson Adjustable Standing Desk | Castlery US", "content": "Emmerson Adjustable Standing Desk | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Tables Desks Emmerson Adjustable Standing Desk Home Tables Desks Emmerson Adjustable Standing Desk Bestseller Emmerson Adjustable Standing Desk 9 reviews $749 Wood : Chinese Walnut Length : 47.2'' 47.2'' 55\" Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Boost your productivity and activity levels even when you're deskbound, with the Emmerson standing desk. This ergonomic desk is height-adjustable and has a handy memory function. See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Table Top: solid walnut; Leg: metal Finish : Walnut stain on wood Cable management : 2 Cable management holes Care : Wooden table Prop65 warning : Lead Dimensions Click to expand Dimension : W47.2\" x D27.6\" x H23.6\"- 49.2\" Product weight : 92.8 lbs Packaging dimensions : 2 boxes Leg height : 22.8\"-48.4\" Leg to leg distance (at height 17.7'') : 36.6\" Leg room - height clearance : 22.8\"-48.4\" Max bearing support : 275.6 lbs Levellers : Included (max 0.4\") Delivery and warranty Cancellation : Free before dispatch Delivery type : Parcel delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/emmerson-adjustable-standing-desk?length=1_2m&wood=chinese_walnut", "title": "Emmerson Adjustable Standing Desk | Castlery US", "content": "Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/casa-extendable-dining-table-60-6-80-3?color_option=light_oak", "title": "Casa Extendable Dining Table,60.6\"-80.3\" | Castlery US", "content": "Casa Extendable Dining Table,60.6\"-80.3\" | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Tables Dining Tables Casa Extendable Dining Table,60.6\"-80.3\" Home Tables Dining Tables Casa Extendable Dining Table,60.6\"-80.3\" New Casa Extendable Dining Table,60.6\"-80.3\" $1,099 Color : Natural Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply With a clean, minimalist build and angled blade legs, Casa adds effortless style to every meal—and extra space for surprise guests. View the Casa Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Body: engineered wood with acacia veneer; Leg: solid acacia wood Finish : NC coating in white wash, solid white wash and light wire brush Care : Extendable table Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Click to expand Dimension : W60.6\"-80.3\" x D37.4\" x H29.9\" Table top thickness : 2\" Product weight : 180.8 lbs Capacity : Sits 6 to 8 people comfortably Packaging dimensions : 2 boxes Leg height : 28\" Leg to leg distance (at height 17.7'') : 49.6\"-69.3\" Leg room - height clearance : 28\" Max bearing support : 220.5 lbs (extended: 176.4 lbs) Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : Grows with your gatherings When dinner plans change from \"just us\" to \"bring a few friends,\" it's easy to make room for plus-ones and twos—simply add a leaf to make space for more company. No two are alike Organic knots and grain variations make every table uniquely yours, giving your space a one-of-a-kind charm. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/casa-extendable-dining-table-60-6-80-3?color_option=light_oak", "title": "Casa Extendable Dining Table,60.6\"-80.3\" | Castlery US", "content": "it's easy to make room for plus-ones and twos—simply add a leaf to make space for more company. No two are alike Organic knots and grain variations make every table uniquely yours, giving your space a one-of-a-kind charm. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/seb-extendable-dining-table-59-78-7", "title": "Seb Extendable Dining Table, 59\"-78.7\" | Castlery US", "content": "Seb Extendable Dining Table, 59\"-78.7\" | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Tables Dining Tables Seb Extendable Dining Table, 59\"-78.7\" Home Tables Dining Tables Seb Extendable Dining Table, 59\"-78.7\" Bestseller Seb Extendable Dining Table, 59\"-78.7\" 577 reviews $999 Model: 4-6 Seater Table 6-8 Seater Table 4-6 Seater Set 6-8 Seater Set Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Rustic, homey and thoughtfully crafted, Seb is a mid-century collection made to create warm, cozy spaces. View the Seb Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Solid acacia wood Leg frame : Solid acacia wood Finish : Muted honey tone and wire brush distressed finish Hardware feature : Split table top with butterfly leaf mechanism Care : Extendable table Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Click to expand Dimension : W59\"/78.7\" x D35.4\" x H29.5\" Product weight : 127.9 lbs Capacity : Sits 4-6 people comfortably Packaging dimensions : 1 box Leg to leg distance (at height 17.7'') : 46\" Leg room - height clearance : 22.4\" Max bearing support : 330.7 lbs Levellers : Included (max 0.8\") Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/seb-extendable-dining-table-59-78-7", "title": "Seb Extendable Dining Table, 59\"-78.7\" | Castlery US", "content": "Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/harper-dining-table?color_option=chestnut_oak&length=1_8m", "title": "Harper Dining Table | Castlery US", "content": "Harper Dining Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Tables Dining Tables Harper Dining Table Home Tables Dining Tables Harper Dining Table Sitewide Sale Harper Dining Table 47 reviews $1,399 Model: Rectangular Round Color : Chestnut Length : 71\" 71\" 86.6\" Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Modern curves and a tamboured design adds style whenever you entertain. View the Harper Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Table Top: engineered wood; Legs: oak veneer slats Finish : Water-based in chestnut finish Care : Wooden table Prop65 warning : Formaldehyde Dimensions Click to expand Dimension : W70.9\" x D37.4\" x H29.9\" Table top thickness : 1.9\" Product weight : 195.1 lbs Packaging dimensions : 2 boxes Leg height : 28\" Max bearing support : 220.5 lbs Levellers : Included Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : More room, less bumping A compact base means more legroom, more comfort, and more reasons for guests to stay longer. Friendly curves​ Not just a pretty silhouette. These curves are intentional —soft on the eyes, gentler on the hips, and built for real life (like midnight snack runs in the dark). Easy clean. Endless hosting. Harper's water-based lacquer finish makes cleanup a breeze—your dinner party remains spotless, stains won't take hold. Pour, clink, relax. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/harper-dining-table?color_option=chestnut_oak&length=1_8m", "title": "Harper Dining Table | Castlery US", "content": "a breeze—your dinner party remains spotless, stains won't take hold. Pour, clink, relax. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/posey-dining-table?length=1_85m", "title": "Posey Dining Table | Castlery US", "content": "Posey Dining Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Tables Dining Tables Posey Dining Table Home Tables Dining Tables Posey Dining Table Sale Posey Dining Table $1,169 $1,299 Model: Rectangular Table Round Table Bench Dining Set Length : 72.8\" 72.8\" 86.6\" Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Inspired by a post-modern bentwood design, we turned the traditional dining table inside-out, to create a standout centerpiece with a base as stunning as it is sturdy. View the Posey Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Engineered wood with oak veneer Finish : Water-based in natural finish Care : Wooden table Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Click to expand Dimension : W72.8\" x D35.4\" x H29.5\" Table top thickness : 1.4\" Leg height : 28.1\" Leg to leg distance (at height 17.7'') : Inner: 34.3\"; Outer: 40.2\" Leg room - height clearance : 27.6\" Max bearing support : 440.9 lbs Levellers : Included Product weight : 132.3 lbs Capacity : Sits 6 people comfortably Packaging dimensions : 2 boxes Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : Family-friendly​ No sharp corners here—just gentle curves and a soft, rounded design that's as easy on the eyes as it is on little hands. Pretty & practical​ Bold, concave legs means there’s plenty of legroom and space for more seats at the table, perfect when friends bring plus-twos instead of plus-ones.​ What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/posey-dining-table?length=1_85m", "title": "Posey Dining Table | Castlery US", "content": "as it is on little hands. Pretty & practical​ Bold, concave legs means there’s plenty of legroom and space for more seats at the table, perfect when friends bring plus-twos instead of plus-ones.​ What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/guin-round-side-table?color_option=shell", "title": "Guin Round Side Table | Castlery US", "content": "Guin Round Side Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Tables Side Tables Guin Round Side Table Home Tables Side Tables Guin Round Side Table Sale Guin Round Side Table 52 reviews $279 $299 Model: Side Table Coffee Table Color : Shell Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Crafted to mimic the texture of natural stone, Guin's organic curves make a statement in your space, be it the living room or backyard. View the Guin Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Glass fiber reinforced concrete Care : GRC/resin table Prop65 warning : Lead Dimensions Click to expand Dimension : W17.7\" x D17.7\" x H18.1\" Product weight : 51.8 lbs Packaging dimensions : 1 box Max bearing support : 66.1 lbs Delivery and warranty Cancellation : Free before dispatch Delivery type : Parcel delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/guin-round-side-table?color_option=shell", "title": "Guin Round Side Table | Castlery US", "content": "Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/sloane-coffee-table-with-drawers?length=0_9m", "title": "Sloane Coffee Table with Drawers | Castlery US", "content": "Sloane Coffee Table with Drawers | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Tables Coffee Tables Sloane Coffee Table with Drawers Home Tables Coffee Tables Sloane Coffee Table with Drawers New Sloane Coffee Table with Drawers $499 Model: Rectangular Square with Drawers Slim Rectangular Length : 35.4\" 35.4\" 47.2'' Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply No need to sacrifice style for storage: Sloane has it all—from elegant fluted details and clean lines to built-in drawers that keep remotes and game controllers out of sight, out of mind. View the Sloane Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Engineered wood with oak veneer Finish : PU lacquer in gray oak Care : Wooden table Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Click to expand Dimension : W35.4\" x D21.7\" x H15.7\" Table top thickness : 1\" Product weight : 67.2 lbs Packaging dimensions : 1 box Leg height : 9.8\" Max bearing support : 220.5 lbs Delivery and warranty Cancellation : Free before dispatch Delivery type : Parcel delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : Natural wood grain Oak’s natural grain takes center stage—knots, nicks, and all—bringing warmth and character to your space. Soft-close storage Drawers with soft-close hinges won't slam shut—reducing wear and tear on your doors and keeping little fingers safe. Fluted with flair Classic and refined, Sloane’s fluted panels bring timeless texture and elegance to your space. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/sloane-coffee-table-with-drawers?length=0_9m", "title": "Sloane Coffee Table with Drawers | Castlery US", "content": "keeping little fingers safe. Fluted with flair Classic and refined, Sloane’s fluted panels bring timeless texture and elegance to your space. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/allura-dining-table?length=1_8m", "title": "Allura Dining Table | Castlery US", "content": "Allura Dining Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Tables Dining Tables Allura Dining Table Home Tables Dining Tables Allura Dining Table New Allura Dining Table $1,099 Model: Rectangular Round Length : 71\" 71\" 86.6\" Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply With its durable resin surface and grounded wood legs, Allura's mixed materials bring a modern balance to your design-forward dining room. View the Allura Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Tabletop: polystone; Legs: solid mindi wood Finish : Tabletop: wavy glossy; Legs: clear lacquer Care : GRC/resin table Prop65 warning : Lead Color variance : Natural variations Dimensions Click to expand Dimension : W70.9\" x D37.4\" x H29.9\" Table top thickness : 1.7\" Product weight : 174.2 lbs Capacity : Sits 6 people comfortably Packaging dimensions : 2 boxes Leg height : 28.3\" Leg to leg distance (at height 17.7'') : 37\" Leg room - height clearance : 28.3\" Max bearing support : 220.5 lbs Levellers : Included Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : Crafted to last, designed to impress Allura’s textured resin tabletop is crafted for lasting durability and designed to impress with effortless style and easy care. Solid wood legs Built from solid, stained white cedar Mindi wood, Allura's legs are as sturdy as they are stylish. No sharp corners here Just gentle curves and a soft, rounded design that's easy on the eyes and guests' hands.​ What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/allura-dining-table?length=1_8m", "title": "Allura Dining Table | Castlery US", "content": "solid, stained white cedar Mindi wood, Allura's legs are as sturdy as they are stylish. No sharp corners here Just gentle curves and a soft, rounded design that's easy on the eyes and guests' hands.​ What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/allura-round-dining-table?diameter=0_9m", "title": "Allura Round Dining Table | Castlery US", "content": "Allura Round Dining Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale New Tables Dining Tables Tables Dining Tables Allura Round Dining Table 2 reviews $649 Model: Rectangular Round Diameter : 35.4\" 35.4\" 47.2\" 59.1\" Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply With its durable resin surface and grounded wood legs, Allura's mixed materials bring a modern balance to your design-forward dining room. View the Allura Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Tabletop: polystone; Legs: solid mindi wood Finish : Tabletop: wavy glossy; Legs: clear lacquer Care : GRC/resin table Prop65 warning : Lead Color variance : Natural variations Dimensions Dimension : W35.4\" x D35.4\" x H29.9\" Table top thickness : 1.7\" Product weight : 84.9 lbs Capacity : Sits 3 people comfortably Packaging dimensions : 2 boxes Leg height : 28.3\" Leg to leg distance (at height 17.7'') : 15.7\" Leg room - height clearance : 28.3\" Max bearing support : 220.5 lbs Levellers : Included Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : Crafted to last, designed to impress Allura’s textured resin tabletop is crafted for lasting durability and designed to impress with effortless style and easy care. Space-savvy design Allura's compact design brings big style to small spaces. No sharp corners here Just gentle curves and a soft, rounded design that's easy on the eyes and guests' hands.​ Solid wood legs Built from solid, stained white cedar Mindi wood, Allura's legs are as sturdy as they are stylish. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/allura-round-dining-table?diameter=0_9m", "title": "Allura Round Dining Table | Castlery US", "content": "No sharp corners here Just gentle curves and a soft, rounded design that's easy on the eyes and guests' hands.​ Solid wood legs Built from solid, stained white cedar Mindi wood, Allura's legs are as sturdy as they are stylish. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/harper-lift-top-coffee-table?color_option=chestnut_oak", "title": "Harper Lift-Top Coffee Table | Castlery US", "content": "Harper Lift-Top Coffee Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Tables Coffee Tables Harper Lift-Top Coffee Table Home Tables Coffee Tables Harper Lift-Top Coffee Table Sale Harper Lift-Top Coffee Table 17 reviews $809 $899 Model: Rectangular Round Lift-Top Color : Chestnut Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Harper's lift-top reveals hidden storage for life's extras and locks steady as a pop-up desk for morning coffee or game nights—a coffee table designed to impress and keep up with you. View the Harper Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Engineered wood with oak veneer Finish : Water based lacquer in chestnut Care : Wooden table Prop65 warning : Formaldehyde Dimensions Click to expand Dimension : W48\" x D24.4\" x H15.4\" Table top thickness : 0.9\" Product weight : 123.5 lbs Capacity : W23.1\" x D22\" x H13\" Packaging dimensions : 1 box Max bearing support : Close: 88.2 lbs; Open: 44.1 lbs Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : Lift with ease, hide in style Out of sight, always within reach. Harper’s gas-lift mechanism makes lifting the tabletop effortless, revealing storage for board games, remotes, and more. The multi-tasker's dream table Coffee table for your morning brew, hidden storage to tuck away games and remotes, and a pop-up desk when inspiration (or deadlines) strike. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/harper-lift-top-coffee-table?color_option=chestnut_oak", "title": "Harper Lift-Top Coffee Table | Castlery US", "content": "morning brew, hidden storage to tuck away games and remotes, and a pop-up desk when inspiration (or deadlines) strike. What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/ashen-dining-table?length=1_5m", "title": "Ashen Dining Table | Castlery US", "content": "Ashen Dining Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Tables Dining Tables Ashen Dining Table Home Tables Dining Tables Ashen Dining Table New Ashen Dining Table $899 Model: Rectangular Round Length : 59\" 59\" 71\" Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Ashen's simple silhouette and refined touches—like rounded legs and a soft, curved edge that's safe for small hands—serve up style as tasteful as your spread. View the Ashen Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Tabletop: engineered wood with ash veneer and solid ash edging; Leg: engineered board with ash veneer Finish : Lacquer Care : Wooden table Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Click to expand Dimension : W59.1\" x D35.4\" x H29.9\"​ Table top thickness : 2\" Product weight : 87.7 lbs Capacity : Sits 4 people comfortably Packaging dimensions : 2 boxes Leg height : 28\" Leg to leg distance (at height 17.7'') : Width: 22.4\"; Length: 46.1\" Leg room - height clearance : 28\" Max bearing support : 220.5 lbs Levellers : Included Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/ashen-dining-table?length=1_5m", "title": "Ashen Dining Table | Castlery US", "content": "Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved. Natural wood grain The natural finish highlights the warmth and distinctive patterns of ash wood, making each piece entirely unique. No sharp corners here Just gentle curves and a soft, rounded design that's easy on the eyes and guests' hands.​"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/mori-coffee-table?color_option=natural_oak", "title": "Mori Coffee Table | Castlery US", "content": "Mori Coffee Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Tables Coffee Tables Mori Coffee Table Home Tables Coffee Tables Mori Coffee Table Bestseller Mori Coffee Table 51 reviews $399 Model: C-Side Table Coffee Table Color : Natural Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Designed to match your Mori Sofa and place your coffee, books, and remote within reach, so you never have to leave your comfort zone. View the Mori Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Engineered wood with oak veneer Finish : Water based in natural, with brushed effect Care : Wooden table Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Click to expand Dimension : W47.2\" x D23.6\" x H12.3\" Table top thickness : 1.7\" Product weight : 43.4 lbs Packaging dimensions : 1 box Leg height : 10.6\" Max bearing support : 110.2 lbs Delivery and warranty Cancellation : Free before dispatch Delivery type : Parcel delivery Warranty : 5-year limited warranty Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved. Low-profile, effortlessly spacious Mori’s low-profile design reduces visual clutter, creating a clean and open"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/mori-coffee-table?color_option=natural_oak", "title": "Mori Coffee Table | Castlery US", "content": "Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved. Low-profile, effortlessly spacious Mori’s low-profile design reduces visual clutter, creating a clean and open feel in your space."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/duncan-round-side-table?color_option=coal", "title": "Duncan Round Side Table | Castlery US", "content": "Duncan Round Side Table | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Tables Side Tables Duncan Round Side Table Home Tables Side Tables Duncan Round Side Table Clearance Duncan Round Side Table 8 reviews $239 $299 Model: Side Table Coffee Table Color : Coal Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Suited for both indoors and outdoors, Duncan's curvaceous, spherical form is sculpted in resin to mimic the texture of natural stone. View the Duncan Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Polystone body and legs Care : GRC/resin table Prop65 warning : Lead Dimensions Click to expand Dimension : W15\" x D15\" x H18.9\" Product weight : 32 lbs Packaging dimensions : 1 box Max bearing support : 66.1 lbs Delivery and warranty Cancellation : Clearance—no cancellation Delivery type : Parcel delivery Warranty : 5-year limited warranty Return policy : Clearance—no return or exchange Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/duncan-round-side-table?color_option=coal", "title": "Duncan Round Side Table | Castlery US", "content": "Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/seb-extendable-dining-set-for-4-6?bench=130cm_creamy%20white&chair_material=twill_performance_creamy_white&chairs_qty=4_chairs", "title": "Seb Extendable Dining Set for 4-6 | Castlery US", "content": "Seb Extendable Dining Set for 4-6 | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Chairs Dining Room Sets Seb Extendable Dining Set for 4-6 Home Chairs Dining Room Sets Seb Extendable Dining Set for 4-6 Sale Seb Extendable Dining Set for 4-6 363 reviews $2,139 $2,254 Model: 4-6 Seater Table 6-8 Seater Table 4-6 Seater Set 6-8 Seater Set Bench : 51.2\" Creamy White 51.2\" Creamy White 51.2\" Slate No Bench Chair material : Performance Creamy White Performance Creamy White Wood Performance Twill, Slate Dark Graphite Chair qty : 4 Chairs 4 Chairs 2 Chairs 6 Chairs Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Rustic, homey and thoughtfully crafted, Seb is a mid-century collection made to create warm, cozy spaces. View the Seb Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Frame: solid acacia wood; Seat: polyester fabric upholstered foam cushion Finish : Muted honey tone and wire brush distressed finish Hardware feature : Split table top with butterfly leaf mechanism Care : Extendable dining set Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Dimension : Table: W59.1\"/78.7\" x D35.4\" x H29.5\"; Chair: W19.7\" x D21.3\" x H32.7\"; Bench: W51.2\" x D15\" x H17.7\" Seatable width : Fabric Chair: 17.7\"; Wood Chair: 16.9\"; Bench: 15\" Seating height : Fabric Chair: 18.9\"; Wood Chair: 17.7\"; Bench: 17.7\" Capacity : Sits 4-6 people comfortably Packaging dimensions : 2-5 boxes Leg to leg distance (at height 17.7'') : 46.1\" Leg room - height clearance : 22.6\" Max bearing support : Table: 220.5 lbs; Chair: 286.6 lbs; Bench: 2 x 286.6 lbs Levellers : Included (max 0.8\") Delivery and warranty Cancellation : Free before dispatch Delivery type :"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/seb-extendable-dining-set-for-4-6?bench=130cm_creamy%20white&chair_material=twill_performance_creamy_white&chairs_qty=4_chairs", "title": "Seb Extendable Dining Set for 4-6 | Castlery US", "content": "Bench: 17.7\" Capacity : Sits 4-6 people comfortably Packaging dimensions : 2-5 boxes Leg to leg distance (at height 17.7'') : 46.1\" Leg room - height clearance : 22.6\" Max bearing support : Table: 220.5 lbs; Chair: 286.6 lbs; Bench: 2 x 286.6 lbs Levellers : Included (max 0.8\") Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : Table: 5 years; Chair and Bench: 10 years Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/vincent-dining-set-for-4-6?table_length=table_150cm&material=vincent_fabric&bench=no_bench&wood=oak&chairs_qty=4_chairs", "title": "Vincent Dining Set for 4-6 | Castlery US", "content": "One size fits you Life isn’t one-size-fits-all—why should your dining set be? Starting out in your first place? Go compact with four chairs. Or hosting the whole crew with six. Whether it's intimate date nights or family dine-ins, Vincent's sized to fit your life. Family-friendly design No sharp edges here—precision-crafted, curved corners give kids a worry-free place to eat and play. Support you can settle into Padded seats and angled seatbacks support you in all the right ways for deep dinner conversations."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/seb-dining-table-set-for-4-6?bench=no_bench&length=1_5m&chair_material=wood&chairs_qty=4_chairs", "title": "Seb Dining Table Set for 4-6 | Castlery US", "content": "Seb Dining Table Set for 4-6 | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Chairs Dining Room Sets Seb Dining Table Set for 4-6 Home Chairs Dining Room Sets Seb Dining Table Set for 4-6 Set Sale Seb Dining Table Set for 4-6 262 reviews $1,539 $1,615 Model: Table 4-6 Seater Set Length : 59\" 59\" 71\" Bench : No Bench No Bench 51.2\" Slate 51.2\" Creamy White 63\" Slate 63\" Creamy White Chair material : Wood Wood Performance Twill, Slate Dark Graphite Performance Creamy White Chair qty : 4 Chairs 4 Chairs 2 Chairs Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Rustic, homey and thoughtfully crafted, Seb is a mid-century collection made to create warm, cozy spaces. View the Seb Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Solid acacia wood Finish : Muted honey tone and wire brush distressed finish Care : Wooden dining set Prop65 warning : Formaldehyde Color variance : Disclaimer Dimensions Dimension : Table: W59\"/71\" x D31.5\"/35.4\" x H29.5\", Bench: W51.2\"/63\" x D15\" x H17.7\", Chair: W19.7\" x 21.3\" x H32.7\" Seatable width : Fabric Chair: 18.1\"; Wood Chair: 15.7\"; Bench: 51.2\"/63\" Seating depth : Fabric Chair: 17.7\"; Wood Chair: 16.9\"; Bench: 15\" Seating height : Fabric Chair: 18.9\"; Wood Chair: 17.7\"; Bench: 17.7\" Capacity : Sits 4/6 people comfortably Packaging dimensions : 2-5 boxes Max bearing support : Table: 220.5 lbs; Chair: 286.6 lbs; Bench: 2 x 286.6 lbs Levellers : Included (max 0.8\") Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : Table: 5 years; Chair and Bench: 10 years Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/seb-dining-table-set-for-4-6?bench=no_bench&length=1_5m&chair_material=wood&chairs_qty=4_chairs", "title": "Seb Dining Table Set for 4-6 | Castlery US", "content": "dimensions : 2-5 boxes Max bearing support : Table: 220.5 lbs; Chair: 286.6 lbs; Bench: 2 x 286.6 lbs Levellers : Included (max 0.8\") Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : Table: 5 years; Chair and Bench: 10 years Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/anya-leather-dining-chair-set?material=caramel&color_option=chestnut_oak", "title": "Anya Leather Dining Chair Set | Castlery US", "content": "Anya Leather Dining Chair Set | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Chairs Dining Room Sets Anya Leather Dining Chair Set Home Chairs Dining Room Sets Anya Leather Dining Chair Set New Anya Leather Dining Chair Set 1 review $638 Model: Wood Fabric Leather Seat Cushion Material : Caramel Stocked Fabrics: View fabric details Get free swatches Color : Chestnut Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Meet your Anya chair's perfect companion: a cushion that stays put, resists spills, and keeps every meal effortlessly comfortable. View the Anya Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Solid-ash and plywood veneer Finish : Chestnut wood Care : Leather seating Prop65 warning : Phthalate Color variance : Natural variations Material details : Top grain leather, crafted from American hides Dimensions Click to expand Dimension : W20.1\" x D21.3\" x H32.3\" Seatable width : 19.7\" Seating depth : 18.5\" Seating height : 17.7\" Product weight : 23.1 lbs (per chair) Packaging dimensions : 2 boxes Backrest height : 32.3\" Max bearing support : 220.5 lbs Delivery and warranty Cancellation : Free before dispatch Delivery type : Parcel delivery Warranty : 10-year limited warranty Return policy : 30-day returns Assembly : Made for real life One wipe, no stress—our Lugano leather is easy to clean, because spills are inevitable.​ What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/anya-leather-dining-chair-set?material=caramel&color_option=chestnut_oak", "title": "Anya Leather Dining Chair Set | Castlery US", "content": "L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/vincent-dining-table-walnut?length=1_5m", "title": "Vincent Dining Table, Walnut | Castlery US", "content": "Built to last The rich grain of solid American walnut wood is a natural conversation starter in your dining room. Its unique character—knots, nicks, and all—will only look better through years of morning coffee and in-law visits. Family-friendly design No sharp edges here. Precision-crafted, softly curved corners give kids a worry-free place to eat and play (with their food, that is). Reinforced support Strength you can count on—thanks to a hidden brace that keeps the tabletop sturdy and the wood’s natural beauty center-stage."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/lily-dining-table-with-4-chairs", "title": "Lily Dining Table with 4 Chairs | Castlery US", "content": "Lily Dining Table with 4 Chairs | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Chairs Dining Room Sets Lily Dining Table with 4 Chairs Home Chairs Dining Room Sets Lily Dining Table with 4 Chairs Set Sale Lily Dining Table with 4 Chairs 417 reviews $1,669 $1,755 Model: Chair Table Dining Set Lily Dining Table 63\" Select ; 4 x Lily Chair Urban Gray Select ; Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply Designed by James Harrison, the stunning Lily collection is characterized by its elegant, tapered legs that leave an unforgettable impression. View the Lily Collection Material Material : Table: walnut veneer and steel supporting tube with brushed brass powder coating; Chair: solid rubber wood frame and foam fiber filled seat and back Leg frame : Solid rubber wood Finish : Table: clear lacquer and brass powder coating; Chair: walnut stain on wood and metal back connector Care : Wooden dining set Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Dimension : Table: W63\"/70.9\"/82.7\" x D35.4\"/35.4\"/39.4\" x H29.5\"; Chair: W19.3\" x D22.4\" x H32.1\" Table top thickness : 1.2\" Product weight : Chair: 33.4 lbs; Table: 53.8 lbs (63\"), 103.6 lbs (74\") Capacity : Sits 4/6 people comfortably Packaging dimensions : 3 boxes Leg height : Table: 28.3\" Leg to leg distance (at height 17.7'') : Table: 42.5\"/50.4\"/62.2\" Max bearing support : Chair: 286 lbs; Table: 220.5 lbs Delivery and warranty Cancellation : Free before dispatch Warranty : Table: 5 years; Chair: 10 years Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/lily-dining-table-with-4-chairs", "title": "Lily Dining Table with 4 Chairs | Castlery US", "content": "Cancellation : Free before dispatch Warranty : Table: 5 years; Chair: 10 years Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/sloane-dining-set-for-6-8?table_length=table_180cm&bench=150_bench&chair_material=fabric_arm_chair&chairs_qty=4_chairs", "title": "Sloane Dining Set for 6-8 | Castlery US", "content": "Sloane Dining Set for 6-8 | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale View more features Home Chairs Dining Room Sets Sloane Dining Set for 6-8 Home Chairs Dining Room Sets Sloane Dining Set for 6-8 Set Sale Sloane Dining Set for 6-8 86 reviews $2,959 $3,114 Model: Dining Table Dining Set Table length : 71\" 71\" 88.6\" Bench : 59\" Bench 59\" Bench 71\" Bench No Bench Chair material : Fabric Arm Chair Fabric Arm Chair Leather Arm Chair Fabric Chair Leather Chair Chair qty : 4 Chairs 4 Chairs 6 Chairs Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply The Sloane Collection is characterized by a sophisticated fluted panel design. Its tactile surface highlights a distinguished wood grain. ​ View the Sloane Collection See how our furniture pairs with other pieces you've been eyeing-no heavy lifting required. Try our room designer tool Material Material : Chair: solid rubber wood frame and cane back; Table and Bench: engineered wood with oak veneer Fabric composition : Bench and Leather Chair: top-grain leather; Fabric Chair: 100% Polyester Finish : Table, Bench and Leather Chair: gray oak on wood; Fabric Chair: black stain on wood Filling : Chair and Bench: PU foam Care : Wooden dining set Prop65 warning : Formaldehyde Color variance : Natural variations Dimensions Dimension : Table: W70.9\"/88.6\" x D35.4\" x H29.9\"; Chair: W18.9\"/22.8\" x D22\" x H31.5\"; Bench: W59.1\"/70.9\" x D16.1\" x H20.3\" Table top thickness : 2\" Seatable width : Chair: 18.9\"; Bench: 59.1\"/70.9\" Seating depth : Chair: 16.9\"; Bench: 16.1\" Seating height : Chair: 19.1\"; Bench: 17.7\" Product weight : Table: 120.2 lbs (70.9\"), 140.2 lbs (88.6\"); Chair: 30.9 lbs (without armrest), 37.9 lbs (with armrest); Bench: 56 lbs (59.1\"), 62.4 lbs (70.9\") Capacity : Sits 6/8 people comfortably Leg height :"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/sloane-dining-set-for-6-8?table_length=table_180cm&bench=150_bench&chair_material=fabric_arm_chair&chairs_qty=4_chairs", "title": "Sloane Dining Set for 6-8 | Castlery US", "content": "top thickness : 2\" Seatable width : Chair: 18.9\"; Bench: 59.1\"/70.9\" Seating depth : Chair: 16.9\"; Bench: 16.1\" Seating height : Chair: 19.1\"; Bench: 17.7\" Product weight : Table: 120.2 lbs (70.9\"), 140.2 lbs (88.6\"); Chair: 30.9 lbs (without armrest), 37.9 lbs (with armrest); Bench: 56 lbs (59.1\"), 62.4 lbs (70.9\") Capacity : Sits 6/8 people comfortably Leg height : 28\" Leg to leg distance (at height 17.7'') : 44.9\" Leg room - height clearance : 28\" Backrest height : 13\" Max bearing support : Table: 220.5 lbs; Chair: 286.6 lbs; Bench: 2/3 x 286.6 lbs Packaging dimensions : 6 boxes Delivery and warranty Cancellation : Free before dispatch Delivery type : Bulky delivery Warranty : Table: 5 years; Chair and Bench: 10 years Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved. Fluted with flair​ Classic and refined, Sloane's fluted panels add depth and elegance, while its gentle curves make cleaning a breeze (because high-style doesn't have to be high maintenance).​ Seats that clean up easy​ Removable bench cushions bring everyday comfort, with the added ease of cleaning when everyday messes come your way. Spills stay put ​ Our Grey Oak chairs feature spill-resistant performance fabric that gives you time to react when glasses tip. Host wine dinners with confidence—keeping the focus on good stories instead of worrying about stains. Sturdy meets style ​ Solid rubberwood chairs provide durability while woven cane backrests add breathable texture for comfort during long dinner conversations. Strength where it counts, lightness where you want it."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/sloane-dining-set-for-6-8?table_length=table_180cm&bench=150_bench&chair_material=fabric_arm_chair&chairs_qty=4_chairs", "title": "Sloane Dining Set for 6-8 | Castlery US", "content": "you time to react when glasses tip. Host wine dinners with confidence—keeping the focus on good stories instead of worrying about stains. Sturdy meets style ​ Solid rubberwood chairs provide durability while woven cane backrests add breathable texture for comfort during long dinner conversations. Strength where it counts, lightness where you want it."}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/theo-dining-table-with-4-joshua-chairs", "title": "Theo Dining Table with 4 Joshua Chairs | Castlery US", "content": "Theo Dining Table with 4 Joshua Chairs | Castlery US Winter Sale: Take up to 35% off selected products​ + extra $120 off with code: WINTRY26 Interior Styling Service Reviews Refer a Friend The Castlery Club Contact Us United States New Sofas Tables Chairs Beds Storage Furniture Sets Outdoor Accessories Tools Sale Home Chairs Dining Room Sets Theo Dining Table with 4 Joshua Chairs Home Chairs Dining Room Sets Theo Dining Table with 4 Joshua Chairs Set Sale Theo Dining Table with 4 Joshua Chairs 595 reviews $2,769 $2,915 Model: 1 Pair 2 Pairs 3 Pairs with Theo Table Theo Round Dining Table 2 x Joshua Chair Pearl Beige Select ; 2 x Joshua Chair Pearl Beige Select ; Add To Cart - Free Deliver to Los Angeles, 90024 Delivery calculated per shipment* View full Delivery Policy here 30-day returns Terms and Conditions apply The Theo Dining Table paired with Joshua Chairs create an ideal spot for intimate dinners, with their curvilinear details and gentle silhouettes. Material Material : Table: walnut veneer with lacquered white glass; Chair: solid rubber wood frame, foam and fabric upholstery Finish : Chair: lacquer in dark walnut stain Filling : PU foam Care : Glass dining set Prop65 warning : Formaldehyde Color variance : Disclaimer Stoppers : Included (0.2'' height) Dimensions Dimension : Table: W47.2\" x D47.2\" x H29.5\"; Chair: W19.7\" x D20.9\" x H31.5\" Seatable width : 19.7\" Seating depth : 15.6\" Seating height : 17.9\" (lowest point) Product weight : Table: 66.1 lbs, Chair: 12.5 lbs Capacity : Sits 4 people comfortably Packaging dimensions : 4 boxes Max bearing support : Table: 264.6 lbs, Chair: 286.6 lbs Delivery and warranty Cancellation : Free before dispatch Warranty : Table: 5 years; Chair: 10 years Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds"}
{"shop": "castlery", "url": "https://www.castlery.com/us/products/theo-dining-table-with-4-joshua-chairs", "title": "Theo Dining Table with 4 Joshua Chairs | Castlery US", "content": "Return policy : 30-day returns Assembly : What's Popular L Shaped Couch Marble Dining Table Extendable Dining Tables Boucle Chair Queen Size Bed King Size Bed About Us Our Story Contact Us Sustainability Trade Program Ambassador Program Affiliate Program Careers Blog In The Press Shopping With Us My Rewards​ Refer a Friend Free Swatches Delivery Product Warranty Sales and Refunds Help Center Try Web AR Accessibility Tool Enjoy $50 off your first order Social #AtHomewithCastlery Privacy Terms Promo Terms* The Castlery Club Terms Sitemap Accessibility Statement Do Not Sell or Share My Personal Information © 2026 Castlery. All rights reserved."}
