{"url": "https://www.article.com/help-center", "title": "Help Center | Article", "content": "Home Help Center Help Center Shipping and Delivery Overview Front Door Delivery In-Room Delivery White Glove Delivery Shipping Beyond Our Standard Service Area Measuring Your Space Scheduling Your Delivery Delivery Day See more Returns and Exchanges Overview 30-Day Satisfaction Guarantee Free Exchanges Returns Warranty Custom Orders Made to Order Upholstery Options Damage After Delivery Payment Overview Payment Methods Customs, Tax, and Tax Exemption When We Charge Payment Discount and Promotional Codes Reserved Stock Security Checks Price Matching See more Product Information Overview Care Guides Our Manufacturers Kid-Friendly Products Pet-Friendly Products Accuracy of Our Photos Weight Capacity Martindale Rating See more Order Tracking Swatches Article Pro & Business Inquiries Overview Article Pro — Trade and Business Programs Article Pro — Customer Support Partnerships Wire Transfer Payment Discounts and Promotional Codes Leesa®️ Mattresses Welcome to Our Help Center Creating a beautiful modern space should be easy — and we’re here to help every step of the way. We've included our most searched-for topics below. Can’t find what you’re looking for? Get in touch with us . Popular Topics: Free Exchanges , Returns , Flat Rate Shipping , Measuring Your Space Shipping and Delivery Returns and Exchanges Payment Product Information Order Tracking Swatches back to top", "shop": "article"}
{"url": "https://www.article.com/help-center/delivery", "title": "Furniture Shipping & Delivery | Article", "content": "Home Help Center Shipping and Delivery Help Center Shipping and Delivery Overview Front Door Delivery In-Room Delivery White Glove Delivery Shipping Beyond Our Standard Service Area Measuring Your Space Scheduling Your Delivery Delivery Day Unboxing and Box Removal Certificate of Insurance Local Delivery Partners Refused Delivery Estimated Delivery Windows Split Deliveries Out of Stock Order Holds Delivery Date Requests Cancellations Haul-Away Services Stolen Packages Shipping + Delivery FAQ Visit Us Returns and Exchanges Overview 30-Day Satisfaction Guarantee Free Exchanges Returns Warranty Custom Orders Made to Order Upholstery Options Damage After Delivery Payment Overview Payment Methods Customs, Tax, and Tax Exemption When We Charge Payment Discount and Promotional Codes Reserved Stock Security Checks Price Matching See more Product Information Overview Care Guides Our Manufacturers Kid-Friendly Products Pet-Friendly Products Accuracy of Our Photos Weight Capacity Martindale Rating See more Order Tracking Swatches Article Pro & Business Inquiries Overview Article Pro — Trade and Business Programs Article Pro — Customer Support Partnerships Wire Transfer Payment Discounts and Promotional Codes Leesa®️ Mattresses Shipping and Delivery On this Page: Front Door Delivery In-Room Delivery White Glove Delivery Shipping Beyond Our Standard Service Area Measuring Your Space Scheduling Your Delivery Delivery Day Unboxing and Box Removal Certificate of Insurance Local Delivery Partners Refused Delivery Estimated Delivery Windows Split Deliveries Out of Stock Order Holds Delivery Date Requests Cancellations Haul-Away Services Stolen Packages Shipping + Delivery FAQ Visit Us We take delivery as seriously as we take design. We pride ourselves on delivering service that’s fast, affordable, and communicative. Below you’ll find a breakdown of our shipping options. Front Door Delivery Our basic shipping offering. At this service level you can expect: Once your order is ready for shipment, our dedicated delivery partners will contact you with the delivery window so you know when to expect your items. Your new furniture will be delivered in its boxes to the front door of your house or apartment building. If you live in a shared building or apartment but are not available during your scheduled delivery window (i.e.: there is no doorman on duty, or you are not home), our delivery partners keep your items and contact you to schedule a new delivery window. If you live in a detached home but are not available during your scheduled delivery window, our delivery partners will leave your items on your front doorstep. A signature is not required to complete delivery. In-Room Delivery Need some extra muscle? Our team has you covered. Here’s what to expect from our In-Room Delivery service: We’ll bring your order beyond the doorstep and into any room you choose. Once your order is ready for delivery, our delivery partners will reach out to you to schedule your delivery and explain what you can expect on delivery day, so you won’t have to worry about any surprises. On delivery day, you’ll receive a notification when our team is approximately 30 minutes away. A signature is required in order to complete delivery. White Glove Delivery Feeling overwhelmed by the thought of putting together your new furniture? We get it. That's why we offer our White Glove Delivery service, designed to help you start enjoying your purchase faster. Here's how it works: We'll go the extra mile by assembling your order in the room of your choice. You don't have to lift a finger. Our team will assemble the furniture in the room of your choosing. Plus, we'll take care of all the packaging, leaving you with a clean and tidy space. Our delivery partners will contact you to schedule a convenient delivery appointment and share what to expect on the big day, alleviating any concerns you might have. On delivery day, you'll receive a notification when our team is approximately 30 minutes away. A signature is required to complete delivery. Please note: while our delivery teams are very handy, they will not install items that could permanently alter your home, like anti-tip hardware or wall attachments. Shipping Beyond Our Standard Service Area We offer competitive delivery options across Canada and the contiguous U.S. Orders to Alaska, Hawaii, or remote areas outside our standard service zone may incur additional flat-rate fees, calculated and displayed at checkout. Adding more items won’t increase your flat-rate Beyond Shipping fee. Currently, we don't ship to Puerto Rico. To check your shipping cost, enter your zip/postal code at checkout. If you live outside our standard service area and would like to initiate an exchange or a return, we're here to help . For exchanges outside our standard service area, we do not offer free exchanges: instead, we will waive your return shipping fee but an additional forward shipping fee will be charged for any new item(s). Measuring Your Space Avoid delivery day disappointments by ensuring your new furniture will fit into your space. Product and box dimensions are listed on each product page. We recommend measuring your space ahead of time to see if a product is the right fit and can be easily moved into the intended room. Generally speaking, the door width should be greater than the box’s height. Some other factors to keep in mind are: Obstructions behind the door Tight corners Hallways or internal doors Stairways (including the length) Elevator measurements For more measuring tips, check out this page . Scheduling Your Delivery Once your order is ready for delivery, our delivery partners will be in touch to schedule your delivery date and explain what you can expect on delivery day. Smaller items are sent via courier. When your order ships, we’ll send you the tracking number so you can know when to expect it. Delivery Day Expecting a delivery? Here’s what to do to prepare for the big day: Ensure that the area where you plan to put your new furniture is clear and there is enough room for assembly. You will receive a notification on the day of delivery when the team is approximately 30 minutes away. If you live in an apartment building, check if you need a Certificate of Insurance for deliveries in advance. If so, email us at finalmile@article.com. Our local shipping partners will deliver your furniture in accordance with your chosen delivery option. Unboxing and Box Removal Our delivery partners will not dispose of any boxes. Our team recommends keeping your boxes in the event you need to initiate an exhange or return. Certificate of Insurance If your building requires a Certificate of Insurance (COI) for delivery, we can help once you’ve placed your order. Just email us at finalmile@article.com. If your building has a specific COI template, please include it as an attachment. If not, please provide the name, address, and the required coverage amount for the COI. Local Delivery Partners If your account shows your order is with a local delivery partner, they should be reaching out to you in approximately two business days to schedule the delivery. If you haven’t heard from them after this time, contact our team and we’ll follow up for you, or provide their direct contact number. Refused Delivery If you refuse your order at the time of delivery, let us know, and we’ll process an exchange for an item that suits your space better. In this case, there won’t be additional shipping fees, and we’ll charge or refund you the difference in price. If you refuse the order without requesting an exchange, it will be processed as a return. Once the item is back at our warehouse, we’ll issue a refund for the item’s price, minus a return shipping fee. Your initial shipping fee won’t be refunded since the delivery was completed. Please note that if we don’t receive notice of a refused delivery, it may delay your refund. Estimated Delivery Windows We cannot guarantee exact delivery dates for orders, but we do offer delivery estimates based on stock levels and shipping routes. This information is updated in real time and can be found on the product page (just look for the delivery truck icon). For larger items that aren’t shipped via courier, you can schedule your delivery with one of our local delivery partners. They will contact you to arrange an appointment once your order is ready to ship. To find your most up-to-date shipping ETA, log in to your My Account page, which will show the latest information available. Please note that we do not offer expedited shipping for any orders. Split Deliveries If your order includes multiple items, we usually wait until your entire order is in stock to ship it together, ensuring one delivery fee and date. If any items are backordered, this may delay your delivery. At checkout, you can choose to receive your in-stock items sooner, but please note that you will be charged for splitting deliveries into two shipments. Smaller items may be shipped separately via courier, and thus may arrive sooner than the rest of your order. You can track your order status on your My Account page. Out of Stock If an item is out of stock with no ETA provided on the product page, you can sign up for notifications when it becomes available again. If an item shows “Back in stock in X weeks,” entering your ZIP/postal code will provide an estimated delivery window, though this may be subject to transit delays. We’ll notify you via email of any delays once the product is on its way from the manufacturer to our warehouse. Order Holds If you'd like to schedule your delivery for a later date than the estimated delivery window, you can add delivery instructions at checkout. Please specify the date you’d prefer to receive your delivery, and we’ll place a temporary hold on your order for up to 30 days. Delivery Date Requests While we can't guarantee a specific delivery date when you place your order, we will provide an estimated delivery window at checkout. You can add delivery instructions to request a specific date within or slightly after this window. The delivery team will do their best to accommodate your request if the item arrives at their facility in time. Delivery appointment availability depends on the local delivery partner in your area. Appointments can only be scheduled once your order reaches their facility, so we can’t guarantee a specific day at the time of your order. However, deliveries generally happen on weekdays between 9 AM and 5 PM. Feel free to ask about other available times when the delivery partner contacts you to schedule your delivery. You’ll receive email updates as your order is processed and shipped from our local warehouse. Cancellations If you’d like to cancel your order, simply log in to your My Account page and click the ‘Cancel Order’ button beside the associated purchase. You will receive a confirmation email shortly after. If your order hasn’t shipped yet, we’ll issue a full refund. If it has shipped, a return shipping fee will apply to ship the item back to us. Depending on your credit card provider, it may take up to 10 business days for your refund to be reflected on your balance. Haul-Away Services We currently don’t offer haul-away services for old or used furniture. Stolen Packages While potential package theft is an issue for all delivery services, we take steps to help ensure your order gets into your hands only. If you live in a high-theft area or have other concerns about the safety of your delivery, please contact our team to let us know. We’ll be happy to change your front door delivery to signature-required. Shipping + Delivery FAQ The first day of my ETA window has passed. Why haven’t I heard anything about my delivery? We’ll reach out to you via text and email to share the delivery date and arrival window as soon as your order is ready. It is common to receive your delivery schedule within your ETA window. My order hasn’t progressed from Processing status. Is there something wrong? Your order will be marked as “Processing” until it reaches a fulfillment center close to your delivery address. Its status will then be updated as it makes its way to you. If your order is coming from overseas, it can take up to several weeks to arrive at the fulfillment center. During this time, it will remain in Processing status. How can I make sure my delivery goes smoothly? We’re so glad you asked! We’ve put together a detailed guide to measuring for delivery to help you prepare for the big day. What do the order statuses mean? Processing : We’ve confirmed your order and are processing your item(s). In Transit : Your item is making its way to a delivery station near you. You will receive an email or text when your delivery is ready to schedule. It’s common to receive your delivery schedule within your ETA window, so not to worry if you’re in your ETA window and haven’t received a delivery date yet. Scheduled : We’ve contacted you with a date and arrival window for your delivery. Delivered : Congrats on the new addition to your home! Visit Us Want some one-on-one time with our furniture before placing your order? Visit our flagship showroom located at 848 East Hastings Street, in the heart of Vancouver’s Strathcona neighborhood. Please note our headquarters are not open to the public—but if you’d like to send some snail mail, you can get in touch with us here: 1010 Raymur Avenue Vancouver, BC Canada V6A 3T2 back to top", "shop": "article"}
{"url": "https://www.article.com/c/recall-information", "title": "Recall | Article", "content": "Home Recall Information Safety Recall Information At Article, we’re committed to your satisfaction and safety above all else. To ensure that our furniture meets the highest standards of quality, we have issued recalls for the following products. Spin Swivel Chair We’re announcing a voluntary recall on Spin Swivel Chairs purchased between July 2021 and June 2023. For more information, click here . To place an order for a free replacement chair base, click here . If you are an Article for Trade customer, click here .", "shop": "article"}
{"url": "https://www.article.com/help-center/returns", "title": "Returns & Exchanges | Article", "content": "Home Help Center Returns and Exchanges Help Center Shipping and Delivery Overview Front Door Delivery In-Room Delivery White Glove Delivery Shipping Beyond Our Standard Service Area Measuring Your Space Scheduling Your Delivery Delivery Day See more Returns and Exchanges Overview 30-Day Satisfaction Guarantee Free Exchanges Returns Warranty Custom Orders Made to Order Upholstery Options Damage After Delivery Payment Overview Payment Methods Customs, Tax, and Tax Exemption When We Charge Payment Discount and Promotional Codes Reserved Stock Security Checks Price Matching See more Product Information Overview Care Guides Our Manufacturers Kid-Friendly Products Pet-Friendly Products Accuracy of Our Photos Weight Capacity Martindale Rating See more Order Tracking Swatches Article Pro & Business Inquiries Overview Article Pro — Trade and Business Programs Article Pro — Customer Support Partnerships Wire Transfer Payment Discounts and Promotional Codes Leesa®️ Mattresses Returns and Exchanges On this Page: 30-Day Satisfaction Guarantee Free Exchanges Returns Warranty Custom Orders Made to Order Upholstery Options Damage After Delivery 30-Day Satisfaction Guarantee Your space should feel perfect, so we offer a 30-day return policy on all our orders. Free Exchanges You can exchange any product in your order up to 30 days after delivery. Shipping on your first exchange for any item is free of charge. If you decide to exchange that item again (i.e. more than once) you will be responsible for any forward and return shipping fees. If your new item costs less, we’ll refund the difference to your original payment method. If it costs more, we'll just charge you the difference when setting up the exchange. Simple as that! Please note that free exchanges aren't available outside our standard delivery area. For an estimate, please get in touch. Leesa®️ mattresses are Third Party Products. For the applicable exchange policy please refer to this section . *Are you a member of our trade program? Please follow up with your account manager for questions about product returns and exchanges, as this policy may not apply to Trade orders Returns If you decide your piece isn’t quite right, you have up to 30 days from the date of delivery to return your furniture. To ensure a successful return, please make sure that your piece is in as-new condition. If you need to initiate a return due to damage, or a defect covered by our warranty, please get in touch. Returns made inside our standard service area will incur a return shipping fee. Returns outside our standard service area are subject to a return fee in the same amount as the forward shipping fee. Once the item is back at our warehouse, it will be inspected by our team. Provided it is in as-new condition, we will issue a refund less any applicable outbound and return shipping fees. Leesa®️ mattresses are Third Party Products, for the applicable return policy please refer to this section. Are you a member of our trade program? Please follow up with your account manager for questions about product returns and exchanges, as this policy may not apply to Trade orders Warranty Sometimes the universe conspires against us. In the unlikely event your piece arrives to you in less than perfect condition, please get in touch . To help us assess the issue, please send photographs of the product taken from various angles and distances. If possible, include photos of the box the product arrived in, as it may have been damaged during transport. If the issue can’t be documented with photos, short videos are also welcome. Our one-year manufacturer’s warranty covers defects in materials and workmanship from the delivery date. If you experience issues with your Article piece, please let our team know. In the event we deem the furniture to be defective, we will organize replacement parts, repairs, and in necessary cases, complete replacements. Please note that our warranties are non-transferable, and cannot be extended to re-sold items. Warranties are only valid when products are used for their intended purpose and exhibit normal use. Defects or damage resulting from negligence, misuse, accidents, abnormal use, or modifications will not be covered by the Article warranty. Custom Orders We’re committed to designing beautiful modern furniture that complements a variety of decor styles and tastes using the highest-quality materials and fabrics. As such, we’re unable to customize our products or provide additional colorways than those offered. Looking for design advice? Our Interior Design team are experts at helping our customers find the perfect piece for their space, style, and functional needs. Plus, it's entirely free. Made to Order Upholstery Options Our newly-introduced line of made-to-order fabrics allow you to personalize your piece with unique upholstery options on some of our product lines. To cut down on unnecessary production costs, lead and shipping time is longer for customized pieces than our stocked color offerings. For the most accurate shipping estimate, please refer to the ETA information on individual product pages. Most companies don’t allow returns on custom items, but we’re not most companies. Customers can return or exchange their Customized items within 30 days from the date of delivery. How? Why? Because we want you to be happy. See our full return policy here. Damage After Delivery Our manufacturer’s warranty covers faults in materials and workmanship. We understand that accidents happen, and while instances of damage in the home are not covered under our warranty, we’re always happy to provide cleaning, care, and repair advice when possible. Our Design Resources page is a great place to find material-specific care advice. back to top", "shop": "article"}
{"url": "https://www.article.com/c/contact-us", "title": "Contact Us | Article", "content": "Home Contact Us Contact Us Have a question? We’re here to help. Live Chat Mon-Fri 6AM - 7PM PT Sat-Sun 7AM - 7PM PT +1-888-746-3455 Mon-Fri 6AM - 5PM PT Sat-Sun 7AM - 5PM PT Email Us Expect a reply within 2 days. Help Center Anytime. Get design services. For free. Article for Pro Enjoy exclusive prices, priority shipping, and dedicated support on Article’s entire assortment of modern furniture and decor. Message Article Pro Support Call Article Pro Support Mon-Fri, 8AM-5PM PT. Join Article Pro Already a member? Log in . Other Inquiries Press Have a story? Drop us a line . Collaborations Let’s build something beautiful together. Connect with us . Retail Want to feel the quality, in real life? Visit our Strathcona store in Vancouver. See store details . Mail For mail or in-person visits (by appointment only): Article 1010 Raymur Avenue Vancouver, BC Canada V6A 3T2", "shop": "article"}
{"url": "https://www.article.com/product/29030/portima-c-side-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Portima Walnut and Black Metal C Side Table | Article", "content": "Home All Products Coffee & Side Tables Portima C Side Table - Walnut Portima C Side Table - Walnut $199 4.8 (461) Portima C Side Table - Walnut $199 4.8 (461) Color: Walnut Add To Cart 30 day satisfaction guarantee. Make it a dream team with Jeppa Side Table - Walnut $249 Details Description With its adjustable height, the Portima Side Table is always exactly where you need it. Crafted with a solid wood top big enough to hold a standard laptop, the Portima is also perfect for keeping your after-work refreshment of choice at arm’s length. Plus, the slim yet sturdy powder-coated steel base slides conveniently under your sofa or chair so you can bring everything a little bit closer if needed. Features Adjustable table height with a solid brass handle Constructed of solid wood and powder-coated steel No assembly required Specifications Style Scandinavian General Dimensions 19\"-26.5\"H x 22\"W x 14\"D Measure For Delivery Weight (lbs) 20 Wood Stain Walnut Metal Finish Black Materials American black walnut, powder-coated steel, brass SKU No. SKU17919 Box Dimensions 8\"H x 17\"W x 25\"L Description With its adjustable height, the Portima Side Table is always exactly where you need it. Crafted with a solid wood top big enough to hold a standard laptop, the Portima is also perfect for keeping your after-work refreshment of choice at arm’s length. Plus, the slim yet sturdy powder-coated steel base slides conveniently under your sofa or chair so you can bring everything a little bit closer if needed. Features Features Adjustable table height with a solid brass handle Constructed of solid wood and powder-coated steel No assembly required Specifications Specifications Style Scandinavian General Dimensions 19\"-26.5\"H x 22\"W x 14\"D Measure For Delivery Weight (lbs) 20 Wood Stain Walnut Metal Finish Black Materials American black walnut, powder-coated steel, brass SKU No. SKU17919 Box Dimensions 8\"H x 17\"W x 25\"L Care Care Wipe with a clean soft cloth. Use of chemical cleaners is not advised. 461 Reviews 4.8 Log in to review Review Policy We love these tables. We have purchased 4 of them now. We love the quality of the tables, how they are packaged and how quickly they are shipped. We are going t... More Teri R. 4 days ago - Gilbert, AZ This is a fantastic side table . Solid and very easy to put together . I love it. Karen S. 1 month ago - Winnipeg, MB Sturdy and love this table so much!! Heather S. 1 month ago - Asheville, NC Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/25776/heidi-48-67-75-extendable-round-dining-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Heidi Walnut Extendable Round Dining Table for 6 | Article", "content": "Home Dining & Kitchen Heidi 48\" - 67.75\" Extendable Round Dining Table - Walnut Heidi 48\" - 67.75\" Extendable Round Dining Table - Walnut $699 4.8 (99) Heidi 48\" - 67.75\" Extendable Round Dining Table - Walnut $699 4.8 (99) Number of Seats: 4-6 people 2-4 people 4-6 people 6-8 people 8-10 people Wood Stain: Walnut Add To Cart 30 day satisfaction guarantee. Make it a dream team with Ulka Dining Chair - Walnut and Ratine Green $149 Details Description From intimate candlelit dinners to cozy late-night drinks way past bedtime, Heidi embodies all the light and airy qualities of the Scandi design style. Crafted from solid and veneered wood, Heidi comfortably accommodates up to six guests thanks to its drop-in leaf extension — no scoochin' over necessary with this one. Features Solid wood frame Veneered Walnut tabletop Includes one drop-in leaf; store in a cool, dry place when not in use Comfortably seats 4; up to 6 with extension leaf Tabletop set atop steel runners; simply unlock the latches and pull both sides apart Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Style Scandinavian General Dimensions 30\"H x 48\"-67.75\"W x 48\"D Measure For Delivery Clearance 29\" Weight (lbs) 82.75 Wood Stain Walnut Materials Solid and veneered walnut, rubberwood, MDF, steel SKU No. SKU25776 Box Dimensions 53\"H x 9\"W x 53\"L Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised Store drop-in leaf in a cool, dry place when not in use Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources Some assembly required (approximately 15 minutes) View assembly instructions (PDF) Description From intimate candlelit dinners to cozy late-night drinks way past bedtime, Heidi embodies all the light and airy qualities of the Scandi design style. Crafted from solid and veneered wood, Heidi comfortably accommodates up to six guests thanks to its drop-in leaf extension — no scoochin' over necessary with this one. Features Features Solid wood frame Veneered Walnut tabletop Includes one drop-in leaf; store in a cool, dry place when not in use Comfortably seats 4; up to 6 with extension leaf Tabletop set atop steel runners; simply unlock the latches and pull both sides apart Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Specifications Style Scandinavian General Dimensions 30\"H x 48\"-67.75\"W x 48\"D Measure For Delivery Clearance 29\" Weight (lbs) 82.75 Wood Stain Walnut Materials Solid and veneered walnut, rubberwood, MDF, steel SKU No. SKU25776 Box Dimensions 53\"H x 9\"W x 53\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised Store drop-in leaf in a cool, dry place when not in use Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources Some assembly required (approximately 15 minutes) View assembly instructions (PDF) The Dine and Unwind Bundle The Dine and Unwind Bundle embodies all the light and airy qualities of the Scandi design style. The Ulka chair features a curved backrest that seamlessly integrates with the rounded-edge frame of the Heidi table, making the desire to remain at the table strong — even well past dinner's end. Made from solid and veneered wood, this bundle reflects a minimal, soft, and compact aesthetic, effortlessly embracing its Scandinavian roots. Shop all dining room bundles Heidi 48\" - 67.75\" Extendable Round Dining Table - Walnut View Product $699 4 x Ulka Dining Chair - White Oak and Ratine Oxide View Product $596 Bundle Discount –$64 Subtotal $1295 $1231 Add Bundle to Cart 99 Reviews 4.8 Log in to review Review Policy Heidi 48–67.75” round dining table (white oak) is the only table in our home. Therefore, we use it not only for breakfasts, lunches, and dinners, but also for b... More Alexandra S. 1 day ago - Hoover, AL We love our chairs paired with the Heidi table; great quality, a clean design, and lots of compliments from guests Shadan G. 1 week ago - North York, ON Very well made and sturdy. Nice smooth finish on the surface. I only wish the bundles were mix and match as I wanted a table and chairs from different dining bundles. Linda P. 1 month ago - Calgary, AB Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/24791/jokuna-48-vinyl-media-unit-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Jokuna American Walnut Vinyl Media Unit w/ Sliding Doors and Record Player Cupboard | Article", "content": "Home All Storage Sideboards & Cabinets Jokuna 48\" Vinyl Media Unit - Walnut Jokuna 48\" Vinyl Media Unit - Walnut $999 4.7 (72) Jokuna 48\" Vinyl Media Unit - Walnut $999 4.7 (72) Unit Type: Record Unit Media Unit Record Unit Add To Cart 30 day satisfaction guarantee. Make it a dream team with Amoeba Side Table - Walnut $149 Details Description Tell me your favorite film is \"High Fidelity\" without telling me your favorite film is \"High Fidelity.\" Alright, enough with the jokes. Our new version of the popular Jokuna Media Unit includes a flip-top lid designed to accommodate a turntable, with a record sleeve holder to display your chosen LP — we know what matters. With its slatted sliding doors for record storage on one side and space for speakers, an amp, or a gaming console on the other, our Jokuna Vinyl Media Unit is the answer to your overflowing record collection. Features Made from a mix of veneered and solid wood: veneer is highly durable, whereas solid wood is used to build beautiful details and support weight Natural wood will have variations in color and texture — no two pieces are alike Slatted sliding doors Soft-close storage drawer Adjustable shelf on left side Record storage on right side Turntable lid with record sleeve holder Space for speakers and an amp on left side Specifications Style Mid-century modern General Dimensions 34.5\"H x 48\"W x 20\"D Measure For Delivery Record Player Recess 7.75\"H x 22.5\"W x 16.25\"D Drawer Dimensions 5\"H x 22\"W x 16.25\"D Clearance 8\" Weight (lbs) 152 Wood Stain Walnut Materials Solid & veneered walnut, MDF, steel, aluminum SKU No. SKU24791 Box Dimensions 35\"H x 25\"W x 52\"L Care & Assembly Clean surface with a clean, wrung out cloth. Use of chemical cleaners is not advised. Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources Warning! To ensure the safety of you, your family, and your guests, this item must be secured to the wall according to the product’s assembly instructions Some assembly required (approximately 15 minutes) View assembly instructions (PDF) Description Tell me your favorite film is \"High Fidelity\" without telling me your favorite film is \"High Fidelity.\" Alright, enough with the jokes. Our new version of the popular Jokuna Media Unit includes a flip-top lid designed to accommodate a turntable, with a record sleeve holder to display your chosen LP — we know what matters. With its slatted sliding doors for record storage on one side and space for speakers, an amp, or a gaming console on the other, our Jokuna Vinyl Media Unit is the answer to your overflowing record collection. Features Features Made from a mix of veneered and solid wood: veneer is highly durable, whereas solid wood is used to build beautiful details and support weight Natural wood will have variations in color and texture — no two pieces are alike Slatted sliding doors Soft-close storage drawer Adjustable shelf on left side Record storage on right side Turntable lid with record sleeve holder Space for speakers and an amp on left side Specifications Specifications Style Mid-century modern General Dimensions 34.5\"H x 48\"W x 20\"D Measure For Delivery Record Player Recess 7.75\"H x 22.5\"W x 16.25\"D Drawer Dimensions 5\"H x 22\"W x 16.25\"D Clearance 8\" Weight (lbs) 152 Wood Stain Walnut Materials Solid & veneered walnut, MDF, steel, aluminum SKU No. SKU24791 Box Dimensions 35\"H x 25\"W x 52\"L Care & Assembly Care & Assembly Clean surface with a clean, wrung out cloth. Use of chemical cleaners is not advised. Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources Warning! To ensure the safety of you, your family, and your guests, this item must be secured to the wall according to the product’s assembly instructions Some assembly required (approximately 15 minutes) View assembly instructions (PDF) 72 Reviews 4.7 Log in to review Review Policy Wish it had a light wood too but it's perfect Jeff Y. 3 weeks ago - Houston, TX Highly recommend this amazing Great quality design, craftsmanship and materials! Marcelo O. 1 month ago - Inglewood, CA Beautiful piece, well built and nicely finished. Great addition to the lounge Craig R. 3 months ago - Edmonton, AB Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/24799/harmon-checkerboard-side-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Harmon Walnut Checker board Game Side Table Combo | Article", "content": "Home All Products Coffee & Side Tables Harmon Checkerboard Side Table - Walnut Harmon Checkerboard Side Table - Walnut $249 4.9 (47) Harmon Checkerboard Side Table - Walnut $249 4.9 (47) Add To Cart 30 day satisfaction guarantee. Complete the look with Otio 26\" Leather Lounge Chair - Walnut and Toscana Tan $899 Details Description Game on. Doubling up as both a side table and gameboard, the Harmon embodies the art of multifunctional furniture. The reversible tabletop offers checkers on one side, while the other provides a solid wood surface ready for post-game celebrations. With hidden storage for game pieces and accessories, the Harmon is fun, good-looking and multifunctional. Features Reversible tabletop with subtle storage allows for game play, or goes incognito as a \"side table\" Table section is removable for ease of play Solid and veneered wood allows for beautiful detailing and long-lasting wear Checkers pieces included Specifications Style Mid-century modern General Dimensions 24\"H x 18\"W x 18\"D Measure For Delivery Interior Dimensions 2.5\"H x 10\"W x 10\"D Weight (lbs) 31 Wood Stain Walnut Materials Solid and veneered walnut, solid oak, MDF, iron SKU No. SKU24799 Box Dimensions 14\"H x 22\"W x 27\"L Care & Assembly Wipe clean with a soft damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) Description Game on. Doubling up as both a side table and gameboard, the Harmon embodies the art of multifunctional furniture. The reversible tabletop offers checkers on one side, while the other provides a solid wood surface ready for post-game celebrations. With hidden storage for game pieces and accessories, the Harmon is fun, good-looking and multifunctional. Features Features Reversible tabletop with subtle storage allows for game play, or goes incognito as a \"side table\" Table section is removable for ease of play Solid and veneered wood allows for beautiful detailing and long-lasting wear Checkers pieces included Specifications Specifications Style Mid-century modern General Dimensions 24\"H x 18\"W x 18\"D Measure For Delivery Interior Dimensions 2.5\"H x 10\"W x 10\"D Weight (lbs) 31 Wood Stain Walnut Materials Solid and veneered walnut, solid oak, MDF, iron SKU No. SKU24799 Box Dimensions 14\"H x 22\"W x 27\"L Care & Assembly Care & Assembly Wipe clean with a soft damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) 47 Reviews 4.9 Log in to review Review Policy I love the checkerboard design. It was easy to put together and is a very sturdy piece. I appreciate the excellent way it was packed for shipping. It looks b... More Norma M. 1 week ago - Bolingbrook, IL This was a Christmas gift for my son. He loves it and said it is perfect and so sturdy! He also had chess pieces that look beautiful on the table. Kim T. 3 weeks ago - Chicago, IL It is a gift for the grandsons! I love it! It will have hours of chess and checker play! Katherine Y. 1 month ago - Black Diamond, WA Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/26999/heidi-62-82-75-extendable-dining-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Heidi Walnut Extendable Dining Table for 6 | Article", "content": "Home Dining & Kitchen Heidi 62\" - 82.75\" Extendable Dining Table - Walnut Heidi 62\" - 82.75\" Extendable Dining Table - Walnut $899 4.8 (23) Heidi 62\" - 82.75\" Extendable Dining Table - Walnut $899 4.8 (23) Number of Seats: 6-8 people 2-4 people 4-6 people 6-8 people 8-10 people Wood Stain: Walnut Add To Cart 30 day satisfaction guarantee. Make it a dream team with Mikkel Dining Chair - Walnut and Algonquin Green $199 Details Description Keeping supper simple since mid-2025. The Heidi table is purposely unembellished to let its thoughtful details shine: a lip of solid-wood edging highlights the beautiful wood grain and visually separates the top and base of the table. A drop-in leaf emerges to accommodate unexpected guests, or to make more room for the fourth-grade poster art project. Next up on our quest to simplify… meal planning. Features Solid wood frame Veneered Walnut tabletop Includes one drop-in leaf; store in a cool, dry place when not in use Comfortably seats 6; up to 8 with extension leaf Tabletop set atop steel runners; simply unlock the latches and pull both sides apart Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Style Scandinavian General Dimensions 30\"H x 62\" - 82.75\"W x 37\"D Measure For Delivery Clearance 25.75\" Weight (lbs) 123.5 Wood Stain Walnut Materials Solid and veneered walnut, rubberwood, MDF SKU No. SKU26999 Box Dimensions 10\"H x 43\"W x 69\"L Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised Store the leaf in a cool, dry place when not in use Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources Some assembly required (approximately 15 minutes) View assembly instructions (PDF) Description Keeping supper simple since mid-2025. The Heidi table is purposely unembellished to let its thoughtful details shine: a lip of solid-wood edging highlights the beautiful wood grain and visually separates the top and base of the table. A drop-in leaf emerges to accommodate unexpected guests, or to make more room for the fourth-grade poster art project. Next up on our quest to simplify… meal planning. Features Features Solid wood frame Veneered Walnut tabletop Includes one drop-in leaf; store in a cool, dry place when not in use Comfortably seats 6; up to 8 with extension leaf Tabletop set atop steel runners; simply unlock the latches and pull both sides apart Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Specifications Style Scandinavian General Dimensions 30\"H x 62\" - 82.75\"W x 37\"D Measure For Delivery Clearance 25.75\" Weight (lbs) 123.5 Wood Stain Walnut Materials Solid and veneered walnut, rubberwood, MDF SKU No. SKU26999 Box Dimensions 10\"H x 43\"W x 69\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised Store the leaf in a cool, dry place when not in use Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources Some assembly required (approximately 15 minutes) View assembly instructions (PDF) 23 Reviews 4.8 Log in to review Review Policy Love this table! My husband was very unsure about purchasing this but I went ahead & did it anyways. Turns out, we both love it! Danielle M. 1 week ago - Leipsic, OH Leaflet is easy to remove. Beautiful and simple design- love the rounded edges. Very happy with my dining room pieces from article! Sarah C. 1 month ago - Orange, CA a really solid table. doesn’t look like particle board like everything else does. the color is a nice beachy light oak, not yellow jaime r. 1 month ago - Saint Petersburg, FL Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/24196/amoeba-side-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Amoeba Walnut Tall Side Table | Article", "content": "Home All Products Coffee & Side Tables Amoeba Side Table - Walnut Amoeba Side Table - Walnut $149 4.8 (491) Amoeba Side Table - Walnut $149 4.8 (491) Wood Stain: Walnut Add To Cart 30 day satisfaction guarantee. Made to go with Amoeba 42.5\" Coffee Table - Walnut $299 Details Description Accentuate your space with the mid century modern Amoeba end table. Several pieces of American Black Walnut are laminated together to form a beautiful table top with visible knots and color variation. Features 100% solid walnut construction Solid wood is great for detailed designs, like dowelling or spindles, and for bearing weight Natural wood will have variations in color and texture — no two pieces are alike Specifications Style Mid-century modern General Dimensions 18.5\"H x 19.5\" Diameter Measure For Delivery Weight (lbs) 9 Wood Stain Walnut Materials Wild Solid American Black Walnut SKU No. SKU360 Box Dimensions 6\"H x 24\"W x 24\"L Care & Assembly Spot clean with a clean damp cloth Use of chemical cleaners is not advised Some assembly required (approximately 15 minutes) View assembly instructions (PDF) Description Accentuate your space with the mid century modern Amoeba end table. Several pieces of American Black Walnut are laminated together to form a beautiful table top with visible knots and color variation. Features Features 100% solid walnut construction Solid wood is great for detailed designs, like dowelling or spindles, and for bearing weight Natural wood will have variations in color and texture — no two pieces are alike Specifications Specifications Style Mid-century modern General Dimensions 18.5\"H x 19.5\" Diameter Measure For Delivery Weight (lbs) 9 Wood Stain Walnut Materials Wild Solid American Black Walnut SKU No. SKU360 Box Dimensions 6\"H x 24\"W x 24\"L Care & Assembly Care & Assembly Spot clean with a clean damp cloth Use of chemical cleaners is not advised Some assembly required (approximately 15 minutes) View assembly instructions (PDF) The Amoeba x Mara Side Table Bundle Accentuate your space with the Amoeba x Mara Side Table Bundle. Inspired by mid-century modern design, both tables feature a compact, clean aesthetic that seamlessly fits into any room of the house. From Ameobas' mid-century atomic design to Mara's polished marble top, the duo is always ready to serve your needs—whether you’re enjoying your morning coffee or creating a cozy nook for your evening unwind. Shop all living room bundles Mara Marble Side Table - Walnut View Product $199 Amoeba Side Table - Walnut View Product $149 Bundle Discount –$17 Subtotal $348 $331 Add Bundle to Cart 491 Reviews 4.8 Log in to review Review Policy Just the right size. Well made, solid matching color for our other furniture. Jean-Paul M. 2 months ago - Brooklyn, NY Simple but elegant! And well made! Compliments the vinyl media console we bought! Alana K. 3 months ago - Franklin, WI Lovely side table matches the coffee table i bought from Article years ago. Angela R. 5 months ago - Kamloops, BC Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/furniture-bundles/606/the-dine-and-unwind-bundle?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "The Dine and Unwind Bundle | Article", "content": "Home Furniture Bundles Dining Room Bundles The Dine and Unwind Bundle The Dine and Unwind Bundle The Dine and Unwind Bundle embodies all the light and airy qualities of the Scandi design style. The Ulka chair features a curved backrest that seamlessly integrates with the rounded-edge frame of the Heidi table, making the desire to remain at the table strong — even well past dinner's end. Made from solid and veneered wood, this bundle reflects a minimal, soft, and compact aesthetic, effortlessly embracing its Scandinavian roots. Heidi 48\" - 67.75\" Extendable Round Dining Table - White Oak View Product $699 4 x Ulka Dining Chair - White Oak and Ratine Oxide View Product $596 Bundle Discount –$64 Subtotal $1295 $1231 Add Bundle to Cart More Dining Room Bundles We promise not to make a “great taste” joke here. (Oops.) Shop all Dining Room Bundles . Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/27599/seno-71-dining-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Seno Walnut Dining Table for 6 People | Article", "content": "Home Dining & Kitchen Seno 71\" Dining Table - Walnut Seno 71\" Dining Table - Walnut $799 4.6 (1073) Seno 71\" Dining Table - Walnut $799 4.6 (1073) Number of Seats: 4-6 people 2-3 people 2-4 people 4-6 people 6-8 people 10-12 people Wood Stain: Walnut Add To Cart 30 day satisfaction guarantee. Made to go with Seno 55\" Bench - Walnut $399 Details Description Pull up a chair to the Seno, where good taste is served daily. A classic mid-century shape, four slim solid wood legs, and a generous-sized tabletop tick all the boxes for a timeless piece of furniture. Comfortably fitting 6 people, the Seno is ready to host all the dinner parties, family game nights, and solo meals of PB&J you can throw at it—just remember to give the guests a placemat. Features Constructed of solid and veneered wood Seats six Natural wood will have variations in color and texture — no two pieces are exactly alike Some assembly required (approximately 15 minutes) Specifications Style Mid-century modern General Dimensions 29\"H x 71\"W x 37.5\"D Measure For Delivery Weight (lbs) 77 Wood Stain Walnut Materials Walnut veneer, solid rubberwood SKU No. SKU365 Box Dimensions 79\"H x 7\"W x 43\"L Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) Description Pull up a chair to the Seno, where good taste is served daily. A classic mid-century shape, four slim solid wood legs, and a generous-sized tabletop tick all the boxes for a timeless piece of furniture. Comfortably fitting 6 people, the Seno is ready to host all the dinner parties, family game nights, and solo meals of PB&J you can throw at it—just remember to give the guests a placemat. Features Features Constructed of solid and veneered wood Seats six Natural wood will have variations in color and texture — no two pieces are exactly alike Some assembly required (approximately 15 minutes) Specifications Specifications Style Mid-century modern General Dimensions 29\"H x 71\"W x 37.5\"D Measure For Delivery Weight (lbs) 77 Wood Stain Walnut Materials Walnut veneer, solid rubberwood SKU No. SKU365 Box Dimensions 79\"H x 7\"W x 43\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) The Dinner Party Pro Bundle You deserve the best of the best. And by the best, we mean a solid wood table and foam-padded chairs you'll never want to get up from. Sturdy and comfortable, there's a reason why the Seno table and Nosh chairs are classics — they're also the reason why dinners will be at yours from now until forever. Shop all dining room bundles Seno 71\" Dining Table - Walnut View Product $799 6 x Nosh Dining Chair - Walnut and Chalk Gray View Product $894 Bundle Discount –$101 Subtotal $1693 $1592 Add Bundle to Cart 1073 Reviews 4.6 Log in to review Review Policy I couldn’t be happier with my new Article table and chairs set! The quality is top notch and shipping and assembly were a breeze. We look forward to hosting and... More Judson S. 1 month ago - Lake Oswego, OR This was my first time purchasing from Article, so I only purchased the table - Article did not disappoint! Love my new table, easy to put together, great quali... More Johanna C. 1 month ago - Huntington Beach, CA This table is breathtaking!! It was so simple to assemble and it is the easiest thing to clean after meals! I’m curious how the top will hold up with our four y... More Olivia D. 1 month ago - Henniker, NH Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/28730/falco-side-table-smoked-oak?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Falco Smoked Solid Oak Wood Sculptural Side Table | Article", "content": "Home All Products Coffee & Side Tables Falco Side Table - Smoked Oak Falco Side Table - Smoked Oak $199 4.9 (80) Falco Side Table - Smoked Oak $199 4.9 (80) Color: Smoked Oak Add To Cart 30 day satisfaction guarantee. Make it a dream team with Baarlo 46\" Coffee Table - Smoked Oak $699 Details Description Designed with a sculpted, cut-out base, the Falco strikes a pose at every angle — a total showstopper, if you will. Name a cooler spot to place your drink, we dare you. Features Constructed of solid wood Sculpted cut-out base No assembly required Specifications Style Scandinavian General Dimensions 17.5\"H x 15.75\"W x 15.75\"D Measure For Delivery Weight (lbs) 21 Wood Stain Smoked Oak Materials Solid oak, steel Contract Grade Our selection of contract grade furniture meets rigorous testing standards conducted in partnership with third-party testing facilities. These products are built for both commercial and residential use. Learn more about our Contract Grade testing in the Help Center. SKU No. SKU24801 Box Dimensions 14\"H x 20\"W x 20\"L Description Designed with a sculpted, cut-out base, the Falco strikes a pose at every angle — a total showstopper, if you will. Name a cooler spot to place your drink, we dare you. Features Features Constructed of solid wood Sculpted cut-out base No assembly required Specifications Specifications Style Scandinavian General Dimensions 17.5\"H x 15.75\"W x 15.75\"D Measure For Delivery Weight (lbs) 21 Wood Stain Smoked Oak Materials Solid oak, steel Contract Grade Our selection of contract grade furniture meets rigorous testing standards conducted in partnership with third-party testing facilities. These products are built for both commercial and residential use. Learn more about our Contract Grade testing in the Help Center. SKU No. SKU24801 Box Dimensions 14\"H x 20\"W x 20\"L Care Care Wipe with a clean damp cloth Use of chemical cleaners is not advised Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources 80 Reviews 4.9 Log in to review Review Policy Nice solid table- great design! Easy to assemble. Love it! Lucy W. 1 month ago - Silver Spring, MD Perfect little table! adrienne r. 3 months ago - Minneapolis, MN Love this piece. Fits perfectly in a small condo next to our armchair. Matches perfectly with our dining set (also smoked oak). Little issue with the dowel putt... More Brian G. 3 months ago - Tampa, FL Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/24198/amoeba-29-5-coffee-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Walnut 29.5\" Wooden Coffee Table | Amoeba | Article", "content": "Home All Products Coffee & Side Tables Amoeba 29.5\" Coffee Table - Walnut Amoeba 29.5\" Coffee Table - Walnut $199 4.6 (308) Amoeba 29.5\" Coffee Table - Walnut $199 4.6 (308) Shape: Triangle Curved Round Triangle Size: 29.5\" 29.5\" 35\" Wood Stain: Walnut Add To Cart 30 day satisfaction guarantee. Bundle together and save with Amoeba 42.5\" Coffee Table - Walnut $299 Details Description A mid-century modern design, the Amoeba Coffee table offers a pleasing focal point to your space. Several pieces of American Black Walnut are laminated together to form a beautiful table top with visible knots and color variation. Features 100% solid walnut construction Solid wood is great for detailed designs, like dowelling or spindles, and for bearing weight Natural wood will have variations in color and texture — no two pieces are alike Specifications Style Mid-century modern General Dimensions 14\"H x 29.5\"W x 23\"D Measure For Delivery Weight (lbs) 14 Wood Stain Walnut Materials Solid American Black Walnut SKU No. SKU389 Box Dimensions 6\"H x 27\"W x 34\"L Care & Assembly Spot clean with a clean damp cloth Use of chemical cleaners is not advised Some assembly required (approximately 15 minutes) View assembly instructions (PDF) Description A mid-century modern design, the Amoeba Coffee table offers a pleasing focal point to your space. Several pieces of American Black Walnut are laminated together to form a beautiful table top with visible knots and color variation. Features Features 100% solid walnut construction Solid wood is great for detailed designs, like dowelling or spindles, and for bearing weight Natural wood will have variations in color and texture — no two pieces are alike Specifications Specifications Style Mid-century modern General Dimensions 14\"H x 29.5\"W x 23\"D Measure For Delivery Weight (lbs) 14 Wood Stain Walnut Materials Solid American Black Walnut SKU No. SKU389 Box Dimensions 6\"H x 27\"W x 34\"L Care & Assembly Care & Assembly Spot clean with a clean damp cloth Use of chemical cleaners is not advised Some assembly required (approximately 15 minutes) View assembly instructions (PDF) The Amoeba Coffee Table Bundle A mid-century modern design, the Amoeba Coffee Table Bundle offers a pleasing focal point to your space. Each table features several solid wood pieces laminated together to form a beautiful tabletop with visible knots and color variation. Shop all living room bundles Amoeba 42.5\" Coffee Table - White Oak View Product $299 Amoeba 29.5\" Coffee Table - Walnut View Product $199 Bundle Discount –$14 Subtotal $498 $484 Add Bundle to Cart 308 Reviews 4.6 Log in to review Review Policy Bought to nest with our larger walnut table. Perfect design. Retro but current. Robert F. 6 days ago - Qualicum Beach, BC This little coffee table is perfect for my small space! It has been hard to find something with some style and quality that fits well in my room. This little ta... More Eleanor D. 4 weeks ago - Longmont, CO Exactly what I was looking for C 1 month ago - Toronto, ON Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/furniture-bundles/276/the-dinner-party-pro-bundle?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "The Dinner Party Pro Bundle | Article", "content": "Home Furniture Bundles Dining Room Bundles The Dinner Party Pro Bundle The Dinner Party Pro Bundle You deserve the best of the best. And by the best, we mean a solid wood table and foam-padded chairs you'll never want to get up from. Sturdy and comfortable, there's a reason why the Seno table and Nosh chairs are classics — they're also the reason why dinners will be at yours from now until forever. Seno 71\" Dining Table - Walnut View Product $799 6 x Nosh Dining Chair - Walnut and Chalk Gray View Product $894 Bundle Discount –$101 Subtotal $1693 $1592 Add Bundle to Cart More Dining Room Bundles We promise not to make a “great taste” joke here. (Oops.) Shop all Dining Room Bundles . Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/16844/kirun-47-console-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Kirun American Walnut Wood Console Table | Article", "content": "Home Dining & Kitchen Kirun 47\" Console - Walnut Kirun 47\" Console - Walnut $299 4.8 (170) Kirun 47\" Console - Walnut $299 4.8 (170) Color: Walnut Add To Cart 30 day satisfaction guarantee. Conceal wear and tear with Touch Up Kit - Dark Walnut $19 Details Description Straight and narrow. The Kirun console table features two places to store and show off your favorite travel trinkets or coffee table books. Beautiful detailing on the solid wood legs and curved solid wood top make for a piece that is eye catching without being demanding. A real stand-up piece. Features Constructed of solid wood Some assembly required (approximately 15 minutes) Specifications Style Scandinavian General Dimensions 29.5\"H x 47\"W x 14\"D Measure For Delivery Shelf Dimensions 10.5\"H x 36\"W x 6\"D Weight (lbs) 24 Wood Stain Walnut Materials American Walnut SKU No. SKU13939 Box Dimensions 52\"H x 10\"W x 19\"L Description Straight and narrow. The Kirun console table features two places to store and show off your favorite travel trinkets or coffee table books. Beautiful detailing on the solid wood legs and curved solid wood top make for a piece that is eye catching without being demanding. A real stand-up piece. Features Features Constructed of solid wood Some assembly required (approximately 15 minutes) Specifications Specifications Style Scandinavian General Dimensions 29.5\"H x 47\"W x 14\"D Measure For Delivery Shelf Dimensions 10.5\"H x 36\"W x 6\"D Weight (lbs) 24 Wood Stain Walnut Materials American Walnut SKU No. SKU13939 Box Dimensions 52\"H x 10\"W x 19\"L Assembly Instructions Assembly Instructions View assembly instructions (PDF) 170 Reviews 4.8 Log in to review Review Policy Great table! Well built and easy to assemble! Impressed with how well it was packed. Julia P. 2 weeks ago - Boise, ID Fits my new entryway perfectly with my daughters painting! Katherine Y. 1 month ago - Black Diamond, WA This is a very striking table, the quality is excellent and I am very happy we ordered it. I would highly recommend. Lorelei M. 3 months ago - Sherwood Park, AB Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/12662/mara-31-5-marble-coffee-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Mara White Marble & Walnut Coffee Table | Article", "content": "Home All Products Coffee & Side Tables Mara 31.5\" Marble Coffee Table - Walnut Mara 31.5\" Marble Coffee Table - Walnut $329 4.6 (1593) Mara 31.5\" Marble Coffee Table - Walnut $329 4.6 (1593) Wood Stain: Walnut Add To Cart 30 day satisfaction guarantee. Made to go with Mara Marble Side Table - Walnut $199 Details Description The Mara might not be as cute as your dog (because what could be?), but it’s just as dependable. Between its compact design and clean aesthetic, this mid-century modern-inspired coffee table looks right at home in any room of the house. Plus, the Mara is easy to move around so it's always there when you need it — think of it as your #1 companion (or #2, if you don't want to make Sparky jealous). Features Polished marble top Solid wood legs Natural marble will have variations in color, tone, and veining pattern — no two pieces are alike Some assembly required (approximately 15 minutes) Specifications Style Mid-century modern General Dimensions 14\"H x 31.5\" Diameter Measure For Delivery Weight (lbs) 40 Wood Stain Walnut Materials American White Oak, engineered wood, Italian Carrara Marble SKU No. SKU418 Box Dimensions 7\"H x 40\"W x 40\"L Care & Assembly Wipe with a clean damp cloth Pro tip: use a coaster. No one likes watermarks. Natural wood is easily stained by moisture; wipe spills immediately. Use of chemical cleaners is not advised View assembly instructions (PDF) Description The Mara might not be as cute as your dog (because what could be?), but it’s just as dependable. Between its compact design and clean aesthetic, this mid-century modern-inspired coffee table looks right at home in any room of the house. Plus, the Mara is easy to move around so it's always there when you need it — think of it as your #1 companion (or #2, if you don't want to make Sparky jealous). Features Features Polished marble top Solid wood legs Natural marble will have variations in color, tone, and veining pattern — no two pieces are alike Some assembly required (approximately 15 minutes) Specifications Specifications Style Mid-century modern General Dimensions 14\"H x 31.5\" Diameter Measure For Delivery Weight (lbs) 40 Wood Stain Walnut Materials American White Oak, engineered wood, Italian Carrara Marble SKU No. SKU418 Box Dimensions 7\"H x 40\"W x 40\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Pro tip: use a coaster. No one likes watermarks. Natural wood is easily stained by moisture; wipe spills immediately. Use of chemical cleaners is not advised View assembly instructions (PDF) The Greatest Hits Bundle For the love of Sven. You deserve the best of the best. And by the best, we mean buttery-soft leather, polished marble, and a living room to brag about. Comfy and luxurious, there’s a reason why the Sven and Mara are classics — they're also the reason why book club is at yours from now on. Shop all living room bundles Sven 88\" Tufted Leather Sofa - Charme Tan View Product $1699 Mara 31.5\" Marble Coffee Table - Walnut View Product $329 Bundle Discount –$101 Subtotal $2028 $1927 Add Bundle to Cart 1593 Reviews 4.6 Log in to review Review Policy So far so good, this fits our conversation area perfectly, and it is placed under a circular style chandelier (see pic). The instructions, while short and to th... More Fred N. 1 day ago - Arlington Heights, IL Very beautiful coffee table. Exactly what I wanted for my living room. Cecilia H. 1 week ago - Ann Arbor, MI Très belle table. Toutefois la conception des pattes fait en sorte que c’est moins solide. Mais somme toute très bon achat Annie P. 3 months ago - Québec, QC Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/24417/lenia-53-5-oval-coffee-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Lenia Black Walnut Solid Wood Oval Coffee Table | Article", "content": "Home All Products Coffee & Side Tables Lenia 53.5\" Oval Coffee Table - Walnut Lenia 53.5\" Oval Coffee Table - Walnut $399 4.7 (298) Lenia 53.5\" Oval Coffee Table - Walnut $399 4.7 (298) Shape: Oval Oval Rectangle Wood Stain: Walnut Add To Cart 30 day satisfaction guarantee. Make a bigger impact with Lenia Storage Side Table - Walnut $349 Details Description Surf’s up. The Lenia coffee table features an oval body reminiscent of the iconic mid-century surfboard shape. A solid wood base and spindle shelf gives you room to stash your latest design magazines, favorite architecture books, and that handmade ceramic bowl you picked up the last time you were in Hawaii. Cowabunga, dude. Features Constructed of solid and veneered wood Solid wood legs and spindles Natural wood will have variations in color and texture — no two pieces are exactly alike Some assembly required (approximately 20 minutes) Specifications Materials Mid-century modern General Dimensions 15\"H x 53.5\"W x 22\"D Measure For Delivery Weight (lbs) 30 Wood Stain Walnut Materials Walnut veneer, solid beech, MDF SKU No. SKU13603 Box Dimensions 8\"H x 26\"W x 58\"L Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) Description Surf’s up. The Lenia coffee table features an oval body reminiscent of the iconic mid-century surfboard shape. A solid wood base and spindle shelf gives you room to stash your latest design magazines, favorite architecture books, and that handmade ceramic bowl you picked up the last time you were in Hawaii. Cowabunga, dude. Features Features Constructed of solid and veneered wood Solid wood legs and spindles Natural wood will have variations in color and texture — no two pieces are exactly alike Some assembly required (approximately 20 minutes) Specifications Specifications Materials Mid-century modern General Dimensions 15\"H x 53.5\"W x 22\"D Measure For Delivery Weight (lbs) 30 Wood Stain Walnut Materials Walnut veneer, solid beech, MDF SKU No. SKU13603 Box Dimensions 8\"H x 26\"W x 58\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) 298 Reviews 4.7 Log in to review Review Policy This is a great table. The oval table is a sleek shape, a little pointy. It’s a modern twist on mid century styling. I also have the fabulous ARTICLE dining room table. Rita B. 1 month ago - Delray Beach, FL Solid! Came as advertised. Happy with how it fits in our living room. Christine K. 2 months ago - Burnaby, BC Beautiful coffee table! Packaging was really done well + no shipping damages + easy to install the legs. Quality is exceptional! Brian T. 5 months ago - San Antonio, TX Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/25669/fantol-43-25-desk-natural-oak?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Fantol Natural Oak Office Desk, Solid Wood Frame, Japandi Style | Article", "content": "Home Home Office Fantol 43.25\" Desk - Natural Oak Fantol 43.25\" Desk - Natural Oak $399 4.5 (28) Fantol 43.25\" Desk - Natural Oak $399 4.5 (28) Desk Type: Writing Desk Leaning Desk Secretary Desk Writing Desk Add To Cart 30 day satisfaction guarantee. Made to go with Fantol 14.5\" File Cabinet - Natural Oak $299 Details Description Meet our much-loved Fantol Desk — this time, minus the bookcase. This streamlined version of the Fantol has more compact proportions, but still boasts all the WFH room you need and smart details like a smooth-close drawer and a handy cubby. It’s like we’ve thought of everything. Features Solid oak frame Push-to-open drawer mechanism Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Style Scandinavian General Dimensions 31\"H x 43.25\"W x 18\"D Measure For Delivery Drawer Dimensions 3.25\"H x 11\"W x 13.25\"D Open Storage Dimensions 3.5\"H x 25.5\"W x 17\"D Clearance 24.75\" Weight (lbs) 54 Wood Stain Natural Oak Materials Solid oak, engineered wood, oak veneer. SKU No. SKU25669 Box Dimensions 32\"H x 19\"W x 44\"L Care & Assembly Wipe with a soft damp cloth. Do not use harsh household cleaners. Try to place wood furniture away from radiators and other heat sources. Sudden changes in temperature can cause wood to dry out and crack, and for joints to shift out of place. Some assembly required (approximately 25 minutes) View assembly instructions (PDF) Description Meet our much-loved Fantol Desk — this time, minus the bookcase. This streamlined version of the Fantol has more compact proportions, but still boasts all the WFH room you need and smart details like a smooth-close drawer and a handy cubby. It’s like we’ve thought of everything. Features Features Solid oak frame Push-to-open drawer mechanism Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Specifications Style Scandinavian General Dimensions 31\"H x 43.25\"W x 18\"D Measure For Delivery Drawer Dimensions 3.25\"H x 11\"W x 13.25\"D Open Storage Dimensions 3.5\"H x 25.5\"W x 17\"D Clearance 24.75\" Weight (lbs) 54 Wood Stain Natural Oak Materials Solid oak, engineered wood, oak veneer. SKU No. SKU25669 Box Dimensions 32\"H x 19\"W x 44\"L Care & Assembly Care & Assembly Wipe with a soft damp cloth. Do not use harsh household cleaners. Try to place wood furniture away from radiators and other heat sources. Sudden changes in temperature can cause wood to dry out and crack, and for joints to shift out of place. Some assembly required (approximately 25 minutes) View assembly instructions (PDF) The Flex Office Bundle Hybrid work has its pros and cons. Pros: sweatpants. Cons: investing in a home office. Luckily, this bundle takes care of the latter. The Fantol Desk is cute, spacious, and compact enough for tight spaces. Feeling stressed mid-workday? Studies show that if you wheel your Svelti Office Chair into the kitchen for a snack every twenty minutes, you can curb work burnout. It's true, we tested it. Tell your boss. Shop all home office bundles Fantol 43.25\" Desk - Natural Oak View Product $399 Svelti Office Chair - Pure White View Product $89 Bundle Discount –$24 Subtotal $488 $464 Add Bundle to Cart 28 Reviews 4.5 Log in to review Review Policy This desk was exactly what we were looking for! It's roomy without taking up too much space and was easy to put together. It feels solid and sturdy and has a go... More Keri S. 21 hours ago - Los Angeles, CA Great small office desk. I don't know if I love that the drawer has no handle (it's a push to open and close) but as long as it keeps working I'm fine with that... More Michole E. 2 weeks ago - Sag Harbor, NY Excellent little desk and Article offer outstanding customer service in an age where that's vanishing. This is my 4th piece from them and love them all. Douglas P. 1 month ago - Laguna Niguel, CA Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/22757/seno-63-low-media-unit-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Seno 63\" Walnut Media Unit with Storage | Article", "content": "Home All Storage Sideboards & Cabinets Seno 63\" Low Media Unit - Walnut Seno 63\" Low Media Unit - Walnut $899 4.8 (677) Seno 63\" Low Media Unit - Walnut $899 4.8 (677) Color: Walnut Add To Cart 30 day satisfaction guarantee. Make it a dream team with Amoeba Side Table - Walnut $149 Details Description With mid-century modern touches like a beveled face and tapered legs, the Seno Media Unit will help you organize all your media devices and accessories in perfect Scandi style. Features Constructed of solid, veneered, and engineered wood Open cabinet with removable shelf Two closed cabinets Discreet cord management system Natural wood will have variations in color and texture — no two pieces are exactly alike Some assembly required (approximately 15 minutes) Specifications Style Mid-century modern General Dimensions 20\"H x 63\"W x 16\"D Measure For Delivery Cabinet Dimensions 10\"H x 16.5\"W x 14\"D Open Storage Dimensions 10\"H x 21\"W x 14\"D Weight (lbs) 86 Wood Stain Walnut Materials Rubberwood, walnut veneer, MDF, steel SKU No. SKU450 Box Dimensions 68\"H x 21\"W x 21\"L Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) Description With mid-century modern touches like a beveled face and tapered legs, the Seno Media Unit will help you organize all your media devices and accessories in perfect Scandi style. Features Features Constructed of solid, veneered, and engineered wood Open cabinet with removable shelf Two closed cabinets Discreet cord management system Natural wood will have variations in color and texture — no two pieces are exactly alike Some assembly required (approximately 15 minutes) Specifications Specifications Style Mid-century modern General Dimensions 20\"H x 63\"W x 16\"D Measure For Delivery Cabinet Dimensions 10\"H x 16.5\"W x 14\"D Open Storage Dimensions 10\"H x 21\"W x 14\"D Weight (lbs) 86 Wood Stain Walnut Materials Rubberwood, walnut veneer, MDF, steel SKU No. SKU450 Box Dimensions 68\"H x 21\"W x 21\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) 677 Reviews 4.8 Log in to review Review Policy Really well packaged, and easy delivery. Assembly super quick, only needed to install the legs and the middle shelf. Can be done by one person in 15 minutes. Lo... More Jean H. 1 month ago - Toronto, ON Absolutely beautiful piece of furniture that warms up our home with gorgeous quality walnut wood. It’s a sturdy, well made piece with a cool mid-century modern feel. Melanie K. 2 months ago - Victoria, BC The quality of the furniture pieces was excellent! It exceeded my expectations. Aldin S. 4 months ago - Mableton, GA Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/23907/torme-c-side-table-smoked-oak?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Torme Smoked Oak Scandinavian Side Table | Article", "content": "Home All Products Coffee & Side Tables Torme C Side Table - Smoked Oak Torme C Side Table - Smoked Oak $249 4.8 (46) Torme C Side Table - Smoked Oak $249 4.8 (46) Color: Smoked Oak Add To Cart 30 day satisfaction guarantee. Made to go with Torme 48\" Storage Coffee Table - Smoked Oak $699 Details Description The Torme is characterized by simple lines and thoughtful details. This side table has softly rounded edges that are subtle but impactful, making the Torme side table a functional, beautiful addition to any space (but especially moody Norwegian studies). Features Constructed of solid and veneered wood Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Style Scandinavian General Dimensions 23\"H x 15\"W x 18\"D Measure For Delivery Weight (lbs) 24.5 Wood Stain Smoked Oak Materials Solid & veneered oak, pine, MDF, steel SKU No. SKU23907 Box Dimensions 27\"H x 19\"W x 22\"L Description The Torme is characterized by simple lines and thoughtful details. This side table has softly rounded edges that are subtle but impactful, making the Torme side table a functional, beautiful addition to any space (but especially moody Norwegian studies). Features Features Constructed of solid and veneered wood Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Specifications Style Scandinavian General Dimensions 23\"H x 15\"W x 18\"D Measure For Delivery Weight (lbs) 24.5 Wood Stain Smoked Oak Materials Solid & veneered oak, pine, MDF, steel SKU No. SKU23907 Box Dimensions 27\"H x 19\"W x 22\"L Care Care Wipe with a clean damp cloth Use of chemical cleaners is not advised Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat source Some assembly required (approximately 30 minutes) The Torme Coffee x Side Table Bundle The Torme Coffee x Side Table Bundle features simple lines and thoughtful details, from deep storage drawers to softly rounded legs. Subtle but impactful, the Torme bundle is a functional, beautiful pairing to any space. Shop all living room bundles Torme 48\" Storage Coffee Table - White Oak View Product $699 Torme C Side Table - Smoked Oak View Product $249 Bundle Discount –$28 Subtotal $948 $920 Add Bundle to Cart 46 Reviews 4.8 Log in to review Review Policy This is a favorite in our living room! Our friends always ask where we got it because it's so functional and looks sleek. I oftentimes work from the living room... More Lisa H. 9 months ago - San Diego , CA we used these side tables for one of our projects in a guest bedroom and gives a more airy feel Carolina S. 9 months ago - North York, ON I love this side table! I've been looking for something sturdy but low enough to sit my books or drinks on and this is perfect. I also love how it looks next to... More Joy B. 9 months ago - South Amboy, NJ Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/furniture-bundles/534/the-dinner-party-pro-bundle-oak?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "The Dinner Party Pro Bundle - Oak | Article", "content": "Home Furniture Bundles Dining Room Bundles The Dinner Party Pro Bundle - Oak The Dinner Party Pro Bundle - Oak You deserve the best of the best. And by the best, we mean a solid wood table and foam-padded chairs you'll never want to get up from. Sturdy and comfortable, there's a reason why the Seno table and Nosh chairs are classics — they're also the reason why dinners will be at yours from now until forever. Seno 71\" Dining Table - Oak View Product $799 6 x Nosh Dining Chair - Oak and Ratine Green View Product $894 Bundle Discount –$101 Subtotal $1693 $1592 Add Bundle to Cart More Dining Room Bundles We promise not to make a “great taste” joke here. (Oops.) Shop all Dining Room Bundles . Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/24773/gambit-side-table-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Gambit Walnut Wood Side Table, Geometric Sculpture Base | Article", "content": "Home All Products Coffee & Side Tables Gambit Side Table - Walnut Gambit Side Table - Walnut $199 4.9 (57) Gambit Side Table - Walnut $199 4.9 (57) Color: Walnut Add To Cart 30 day satisfaction guarantee. Make it a dream team with Portima C Side Table - Walnut $199 Details Description Gambit embraces the playful essence of mid-century design. Its angular wood-turned base exudes vibrancy and boldness, creating a statement piece fit for the MOMA. It's not just a pretty face, though — its durable construction guarantees it can handle the rigors of everyday home use, too. Features Angular wood-turned base Constructed of solid and veneered wood Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Style Mid-century modern General Dimensions 20\"H x 17\"W x 17\"D Measure For Delivery Weight (lbs) 27 Wood Stain Walnut Materials Solid and veneered rubberwood, walnut veneer, MDF, iron SKU No. SKU24773 Box Dimensions 22\"H x 19\"W x 16\"L Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised Some assembly required (approximately 5 minutes) View assembly instructions (PDF) Description Gambit embraces the playful essence of mid-century design. Its angular wood-turned base exudes vibrancy and boldness, creating a statement piece fit for the MOMA. It's not just a pretty face, though — its durable construction guarantees it can handle the rigors of everyday home use, too. Features Features Angular wood-turned base Constructed of solid and veneered wood Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Specifications Style Mid-century modern General Dimensions 20\"H x 17\"W x 17\"D Measure For Delivery Weight (lbs) 27 Wood Stain Walnut Materials Solid and veneered rubberwood, walnut veneer, MDF, iron SKU No. SKU24773 Box Dimensions 22\"H x 19\"W x 16\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised Some assembly required (approximately 5 minutes) View assembly instructions (PDF) 57 Reviews 4.9 Log in to review Review Policy Impressively intuitive packing made the item arrive in perfect condition and made it very easy to assemble. Solid wood and quality finish make this table an ass... More Katrina H. 2 months ago - Saint Paul, MN It looks even better at home than online. Solid wood, no defects. Adds to room. Maria B. 3 months ago - Melbourne, FL I absolutely love this side table. It is perfect for sitting a drink on. Have gotten so many compliments on the design. Donna . 5 months ago - Crestline, CA Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/21559/mysen-33-5-cabinet-walnut?queryID=0e3a37434199f6cc6d561f017e9be137&index=production_product", "title": "Mysen American Walnut Cabinet w/ Doors | Article", "content": "Home Dining & Kitchen Mysen 33.5\" Cabinet - Walnut Mysen 33.5\" Cabinet - Walnut $599 4.8 (65) Mysen 33.5\" Cabinet - Walnut $599 4.8 (65) Color: Walnut Add To Cart 30 day satisfaction guarantee. Make a bigger impact with Touch Up Kit - Dark Walnut $19 Details Description POV: you being organized. Designed with open shelves and closed cabinets, our multi-function Mysen Cabinet keeps your treasured publications on full display and your more personal items (like those cozy blankets you could never part with) stowed away in either of its roomy, soft-close cabinets. Show off what you want — the rest can be our little secret. Features Soft-close doors Solid and veneered American walnut Natural wood will have variations in color and texture — no two pieces are exactly alike Warning! To ensure the safety of you, your family, and your guests, this item must be secured to the wall according to the product’s assembly instructions No assembly required Specifications Style Scandinavian General Dimensions 33.5\"H x 33.5\"W x 16\"D Measure For Delivery Cabinet Dimensions 14\"H x 12.5\"W (narrow) - 19.25\"W (wide) x 13.25\"D Weight (lbs) 61.5 Wood Stain Walnut Materials Solid walnut, MDF, walnut veneer SKU No. SKU19468 Box Dimensions 20\"H x 37\"W x 38\"L Care & Assembly Wipe with a soft damp cloth. Do not use harsh household cleaners. Try to place wood furniture away from radiators and other heat sources. Sudden changes in temperature can cause wood to dry out and crack, and for joints to shift out of place. View assembly instructions (PDF) Description POV: you being organized. Designed with open shelves and closed cabinets, our multi-function Mysen Cabinet keeps your treasured publications on full display and your more personal items (like those cozy blankets you could never part with) stowed away in either of its roomy, soft-close cabinets. Show off what you want — the rest can be our little secret. Features Features Soft-close doors Solid and veneered American walnut Natural wood will have variations in color and texture — no two pieces are exactly alike Warning! To ensure the safety of you, your family, and your guests, this item must be secured to the wall according to the product’s assembly instructions No assembly required Specifications Specifications Style Scandinavian General Dimensions 33.5\"H x 33.5\"W x 16\"D Measure For Delivery Cabinet Dimensions 14\"H x 12.5\"W (narrow) - 19.25\"W (wide) x 13.25\"D Weight (lbs) 61.5 Wood Stain Walnut Materials Solid walnut, MDF, walnut veneer SKU No. SKU19468 Box Dimensions 20\"H x 37\"W x 38\"L Care & Assembly Care & Assembly Wipe with a soft damp cloth. Do not use harsh household cleaners. Try to place wood furniture away from radiators and other heat sources. Sudden changes in temperature can cause wood to dry out and crack, and for joints to shift out of place. View assembly instructions (PDF) 65 Reviews 4.8 Log in to review Review Policy Very nice piece, well built. Came securely packaged. Ellen P. 2 weeks ago - Madison, WI Pricey but nice Ehsan S. 3 months ago - Verdun, QC This cabinet is beautiful! Very pleased with it. Excellent craftsmanship. Tim H. 4 months ago - Seattle, WA Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/19540/ozetta-concrete-side-table-moonlit-black?queryID=d9eecda417743fefdeb2af5d87afc26f&index=production_product", "title": "Ozetta Moonlit Black Plaster Texture Pedestal Side Table, Japandi Style | Article", "content": "Home All Products Coffee & Side Tables Ozetta Concrete Side Table - Moonlit Black Ozetta Concrete Side Table - Moonlit Black $249 4.7 (46) Ozetta Concrete Side Table - Moonlit Black $249 4.7 (46) Color: Moonlit Black Add To Cart 30 day satisfaction guarantee. Complete the look with Adel 35\" Coffee Table - Smoked Oak $499 Details Description Made of concrete, the Ozetta may have a hard exterior but its clean lines, smooth top, and soft curves make it a total softie, just like your “cool” older brother who pretends he’s never cried a day in his life. Use the Ozetta as a bedside table or in your living room as a conversation starter. It's also the perfect size for a box of tissues — tell your brother. Features Constructed of concrete stone composite Smooth table top Textured pedestal base Cement is a composite material that will have variation in color and texture — no two pieces are alike No assembly required Specifications Style Scandinavian General Dimensions 20\"H x 18\"W x 18\"D Measure For Delivery Weight (lbs) 44 Color Moonlit Black Materials Concrete, fiberglass Contract Grade Our selection of contract grade furniture meets rigorous testing standards conducted in partnership with third-party testing facilities. These products are built for both commercial and residential use. Learn more about our Contract Grade testing in the Help Center. SKU No. SKU19540 Box Dimensions 25\"H x 24\"W x 24\"L Description Made of concrete, the Ozetta may have a hard exterior but its clean lines, smooth top, and soft curves make it a total softie, just like your “cool” older brother who pretends he’s never cried a day in his life. Use the Ozetta as a bedside table or in your living room as a conversation starter. It's also the perfect size for a box of tissues — tell your brother. Features Features Constructed of concrete stone composite Smooth table top Textured pedestal base Cement is a composite material that will have variation in color and texture — no two pieces are alike No assembly required Specifications Specifications Style Scandinavian General Dimensions 20\"H x 18\"W x 18\"D Measure For Delivery Weight (lbs) 44 Color Moonlit Black Materials Concrete, fiberglass Contract Grade Our selection of contract grade furniture meets rigorous testing standards conducted in partnership with third-party testing facilities. These products are built for both commercial and residential use. Learn more about our Contract Grade testing in the Help Center. SKU No. SKU19540 Box Dimensions 25\"H x 24\"W x 24\"L Care Care Wipe spills immediately to avoid staining Use place mats and coasters to protect surface The use of citrus and chemical based cleaners is not advised The Raw Elegance Bundle Saddle up. The Nirvana Dakota Tan leather chair transports you to sunny afternoons on the ranch — or an urban, rainy city loft. With its high-density foam-filled cushions, this lounge chair comes with a warning: it's so comfortable you might never leave. Paired with the concrete Ozetta, it may have a hard exterior but its clean lines, smooth top, and soft curves make it a total softie, just like your \"cool\" older brother who pretends he's never cried a day in his life. It's also the perfect size for a box of tissues — tell your brother. Shop all living room bundles Nirvana 30\" Leather Lounge Chair - Dakota Tan View Product $999 Ozetta Concrete Side Table - Moonlit Black View Product $249 Bundle Discount –$62 Subtotal $1248 $1186 Add Bundle to Cart 46 Reviews 4.7 Log in to review Review Policy Such an elegant design! I love the simple lines and the light-play of the textures. The finish is flawless and the construction substantial. Solid, shock-absorb... More Kelly C. 2 weeks ago - Allen, TX You get exactly what you see. Quality of the materials, finish, and packaging are top notch. Perfect addition to the living room next to the Sunny lounge chair. Joseph R. 2 months ago - Port Perry, ON Perfect, perfect, perfect! It’s even better than I envisioned and fits the space perfectly. High quality at an affordable price. This will last for years and years. Michelle M. 3 months ago - Nashville, TN Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/15278/culla-55-desk-walnut?queryID=d9eecda417743fefdeb2af5d87afc26f&index=production_product", "title": "Culla Walnut Computer Desk w/ Drawers | Article", "content": "Home Home Office Culla 55\" Desk - Walnut Culla 55\" Desk - Walnut $499 4.7 (300) Culla 55\" Desk - Walnut $499 4.7 (300) Color: Walnut Add To Cart 30 day satisfaction guarantee. Make a bigger impact with Svelti Office Chair - Berry Blue $89 Details Description Work wonders. Whether catching up on emails or writing a pile of thank you notes, the Culla desk’s solid construction, smooth wood surface, and streamlined design add a touch of style to any task. Two drawers keep your papers and takeout lunch menus organized while the middle shelf is the perfect place to stash your keyboard. Features Solid and veneered Walnut Wood is a natural material with diverse patterning and color. Variations should be expected and treasured as a unique element. Some assembly required (approximately 15 minutes) Specifications Style Mid-century modern General Dimensions 30\"H x 55\"W x 20\"D Measure For Delivery Drawer Dimensions 2.5\"H x 8.5\"W x 13\"D Open Storage Dimensions 2.5\"H x 19.5\"W x 14.5\"D Weight (lbs) 51 Wood Stain Walnut Materials Solid and veneered Walnut, MDF SKU No. SKU13039 Box Dimensions 64\"H x 10\"W x 25\"L Care & Assembly Spot clean with a clean damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) Description Work wonders. Whether catching up on emails or writing a pile of thank you notes, the Culla desk’s solid construction, smooth wood surface, and streamlined design add a touch of style to any task. Two drawers keep your papers and takeout lunch menus organized while the middle shelf is the perfect place to stash your keyboard. Features Features Solid and veneered Walnut Wood is a natural material with diverse patterning and color. Variations should be expected and treasured as a unique element. Some assembly required (approximately 15 minutes) Specifications Specifications Style Mid-century modern General Dimensions 30\"H x 55\"W x 20\"D Measure For Delivery Drawer Dimensions 2.5\"H x 8.5\"W x 13\"D Open Storage Dimensions 2.5\"H x 19.5\"W x 14.5\"D Weight (lbs) 51 Wood Stain Walnut Materials Solid and veneered Walnut, MDF SKU No. SKU13039 Box Dimensions 64\"H x 10\"W x 25\"L Care & Assembly Care & Assembly Spot clean with a clean damp cloth Use of chemical cleaners is not advised View assembly instructions (PDF) The Compact Home Office Bundle Don’t let the slim silhouette of the Culla Desk fool you, this bundle is a compact home office setup with a big “let’s get sh*t done” disposition. The Culla, paired with the smooth swivel of the iconic Svelti Office Chair, projects a sense of order while also offering enough space to conceal the chaos we all know lies within. Sit back, relax, swivel a little. You got this. Shop all home office bundles Svelti Office Chair - Berry Blue View Product $89 Culla 55\" Desk - Walnut View Product $499 Bundle Discount –$29 Subtotal $588 $559 Add Bundle to Cart 300 Reviews 4.7 Log in to review Review Policy This is a beautiful desk and fits in my space perfectly. Love it!! I am happy with the fast shipping and there was very little assembly required. Anne A. 2 weeks ago - Aurora, ON Perfect size desk for open loft space Jay C. 2 months ago - Marietta, GA Love it! Looks great. Easy to assemble. I didn’t use the wall anchor. Margaret M. 2 months ago - South Saint Paul, MN Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/25777/heidi-42-round-dining-table-walnut?queryID=d9eecda417743fefdeb2af5d87afc26f&index=production_product", "title": "Heidi Walnut Round Dining Table for 4 | Article", "content": "Home Dining & Kitchen Heidi 42\" Round Dining Table - Walnut Heidi 42\" Round Dining Table - Walnut $499 4.9 (36) Heidi 42\" Round Dining Table - Walnut $499 4.9 (36) Number of Seats: 2-4 people 2-4 people 4-6 people 6-8 people 8-10 people Wood Stain: Walnut Add To Cart 30 day satisfaction guarantee. Make it a dream team with Ulka Dining Chair - Walnut and Ratine Buff $149 Details Description From intimate candlelit dinners to cozy late-night drinks way past bedtime, Heidi embodies all the light and airy qualities of the Scandi design style. Crafted from solid and veneered wood, Heidi comfortably accommodates four guests — maybe a little more if you don't mind scoochin' over. Features Solid wood frame Veneered Walnut tabletop Comfortably seats up to 4 Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Style Scandinavian General Dimensions 30\"H x 42\" Diameter Measure For Delivery Clearance 26\" Weight (lbs) 46 Wood Stain Walnut Materials Solid and veneered walnut, rubberwood, MDF, steel Contract Grade Our selection of contract grade furniture meets rigorous testing standards conducted in partnership with third-party testing facilities. These products are built for both commercial and residential use. Learn more about our Contract Grade testing in the Help Center. SKU No. SKU25777 Box Dimensions 47\"H x 7\"W x 47\"L Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources Some assembly required (approximately 15 minutes) View assembly instructions (PDF) Description From intimate candlelit dinners to cozy late-night drinks way past bedtime, Heidi embodies all the light and airy qualities of the Scandi design style. Crafted from solid and veneered wood, Heidi comfortably accommodates four guests — maybe a little more if you don't mind scoochin' over. Features Features Solid wood frame Veneered Walnut tabletop Comfortably seats up to 4 Natural wood will have variations in color and texture — no two pieces are exactly alike Specifications Specifications Style Scandinavian General Dimensions 30\"H x 42\" Diameter Measure For Delivery Clearance 26\" Weight (lbs) 46 Wood Stain Walnut Materials Solid and veneered walnut, rubberwood, MDF, steel Contract Grade Our selection of contract grade furniture meets rigorous testing standards conducted in partnership with third-party testing facilities. These products are built for both commercial and residential use. Learn more about our Contract Grade testing in the Help Center. SKU No. SKU25777 Box Dimensions 47\"H x 7\"W x 47\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Use of chemical cleaners is not advised Changes in temperature can cause wood to dry out and crack, and joints to shift out of place. We recommend placing wood furniture away from radiators and other heat sources Some assembly required (approximately 15 minutes) View assembly instructions (PDF) The Blissful Nook Bundle From intimate candlelit dinners to cozy late-night drinks that stretch well past bedtime, the Blissful Nook Bundle captures the light and airy essence of Scandi design. Made from solid and veneered wood, its sharp lines are softened by curved edges, and the padded upholstered seat encourages long evenings filled with snacks, board games, and good company. If only making dinner every night could be this simple and enjoyable. Shop all dining room bundles Heidi 42\" Round Dining Table - Walnut View Product $499 4 x Mikkel Dining Chair - Walnut and Algonquin Green View Product $796 Bundle Discount –$90 Subtotal $1295 $1205 Add Bundle to Cart 36 Reviews 4.9 Log in to review Review Policy Perfect size for my space. The quality is there, it was packed very well and it was easy to assemble. The color was a little bit darker than expected. Karen K. 1 month ago - Redlands, CA I love my new table it goes perfect in my space , was easy to assemble and the delivery time was quick and smooth Debbie G. 1 month ago - Abbotsford, BC This sturdy dining table is the perfect size for our breakfast nook. The wood grain is beautiful and we have eaten many meals around this table. I also love tha... More Melissa M. Featured 1 month ago - Washougal, WA Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
{"url": "https://www.article.com/product/25968/quincy-57-5-kitchen-island-smoked-oak?queryID=d9eecda417743fefdeb2af5d87afc26f&index=production_product", "title": "Quincy Smoked Oak Wood & Quartz Kitchen Island w/ Counter Stool Seating, Soft-Close Storage Drawers | Article", "content": "Home Dining & Kitchen Quincy 57.5\" Kitchen Island - Smoked Oak Quincy 57.5\" Kitchen Island - Smoked Oak $1499 5 (61) Quincy 57.5\" Kitchen Island - Smoked Oak $1499 5 (61) Color: Smoked Oak Add To Cart 30 day satisfaction guarantee. Make it a dream team with Nosh Counter Stool - Walnut and Hemlock Green $199 Details Description If you could bring only three things to your kitchen island, what would they be? Friends? Food? Wine? Great choices, because we designed the Quincy with all three in mind. Our version of the kitchen island offers spacious storage, extra seating, and a generous counter top for food prep — finally, space to roll out the family’s famous biscuit recipe. Go make grandma proud. Features Featuring a durable quartz countertop Constructed of solid and veneered oak wood Push-to-open drawers Slatted exterior shelf and concealed glass rack Space for two counter stools Specifications Style Coastal General Dimensions 36\"H x 57.5\"W x 34.25\"D Measure For Delivery Drawer Dimensions 5\"H x 23.5\"W x 13\"D Shelf Dimensions 14.5\"H x 55\"W x 13\"D Seating Clearance 35\" Weight (lbs) 284 Wood Stain Smoked Oak Materials Solid white oak, white oak veneer, rubberwood, plywood, quartz, steel Contract Grade Our selection of contract grade furniture meets rigorous testing standards conducted in partnership with third-party testing facilities. These products are built for both commercial and residential use. Learn more about our Contract Grade testing in the Help Center. SKU No. SKU25968 Box Dimensions 6\"H x 41\"W x 65\"L 24\"H x 42\"W x 64\"L Care & Assembly Wipe with a clean damp cloth Pro tip: use a coaster. No one likes watermarks. Natural wood is easily stained by moisture; wipe spills immediately. Use of chemical cleaners is not advised Due to the Quincy’s size and weight, we recommend enlisting some helpers. Consider purchasing our Inside Room & Assembly service. Assembly required (approximately 40 minutes) View assembly instructions (PDF) Description If you could bring only three things to your kitchen island, what would they be? Friends? Food? Wine? Great choices, because we designed the Quincy with all three in mind. Our version of the kitchen island offers spacious storage, extra seating, and a generous counter top for food prep — finally, space to roll out the family’s famous biscuit recipe. Go make grandma proud. Features Features Featuring a durable quartz countertop Constructed of solid and veneered oak wood Push-to-open drawers Slatted exterior shelf and concealed glass rack Space for two counter stools Specifications Specifications Style Coastal General Dimensions 36\"H x 57.5\"W x 34.25\"D Measure For Delivery Drawer Dimensions 5\"H x 23.5\"W x 13\"D Shelf Dimensions 14.5\"H x 55\"W x 13\"D Seating Clearance 35\" Weight (lbs) 284 Wood Stain Smoked Oak Materials Solid white oak, white oak veneer, rubberwood, plywood, quartz, steel Contract Grade Our selection of contract grade furniture meets rigorous testing standards conducted in partnership with third-party testing facilities. These products are built for both commercial and residential use. Learn more about our Contract Grade testing in the Help Center. SKU No. SKU25968 Box Dimensions 6\"H x 41\"W x 65\"L 24\"H x 42\"W x 64\"L Care & Assembly Care & Assembly Wipe with a clean damp cloth Pro tip: use a coaster. No one likes watermarks. Natural wood is easily stained by moisture; wipe spills immediately. Use of chemical cleaners is not advised Due to the Quincy’s size and weight, we recommend enlisting some helpers. Consider purchasing our Inside Room & Assembly service. Assembly required (approximately 40 minutes) View assembly instructions (PDF) 61 Reviews 5 Log in to review Review Policy Love it !! Valerie T. 1 week ago - Ottawa, ON Absolutely superb island. Met all my criteria, including having a quartz top instead of marble. Amay N. 1 month ago - Toronto, ON The island is gorgeous and so functional with 4 soft close drawers. The quartz is really nice and we love that you can hang wine glasses on the bottom. Wonderfu... More Kimberly S. 1 month ago - Jamaica Plain, MA Read More Reviews Why buy from Article? Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us Modern Furniture at Fair Prices Our promise? High-quality furniture at radically lower (and much fairer) prices than comparable retailers. Learn more 30-Day Satisfaction Guarantee We’re confident you’ll love your new Article furniture, but just to make sure, you have 30 days to try it out. Learn more We’re Here To Help If questions arise, our friendly and knowledgeable Customer Care team is just a phone call, chat, or email away. Contact us", "shop": "article"}
